{"url_to_unified_index": {"https://business.maryland.gov/news/perdue-celebrates-50-years-of-legendary-brand/": 4, "https://2dadswithbaggage.com/the-truth-about-perdue-chicken/": 37, "https://valdostadailytimes.com/2016/06/29/perdue-to-change-chicken-killing-process/": 14, "https://ir.library.louisville.edu/cgi/viewcontent.cgi?article=1778&context=faculty": 17, "https://aldf.org/article/lawsuit-alleges-usda-fails-to-protect-consumers-from-deceptive-chicken-and-turkey-product-labeling/": 18, "https://corporate.perduefarms.com/responsibility/animal-care/programs-practices/": 16, "https://corporate.perduefarms.com/responsibility/animal-care/": 19, "https://civileats.com/2021/10/14/better-chicken-commitment-fast-food-grocery-giants-promise-sell-better-chicken-is-it-enough-perdue-tyson-cage-free-labeling/": 21, "https://www.theatlantic.com/business/archive/2016/10/perdue-chicken/503423/": 20, "https://en.wikipedia.org/wiki/Perdue_Farms": 10, "https://delawarebusinesstimes.com/supplements/perdue-farms-humane/": 11, "https://www.manufacturingdive.com/news/perdue-farms-seeks-dismiss-pfas-lawsuit-again-Maryland-environment/743529/": 15, "https://www.foodprocessing.com/ingredients/animal-proteins/article/11298502/humane-alternatives-for-poultry-slaughter": 12, "https://corporate.perduefarms.com/responsibility/animal-care/faqs/": 13, "https://www.princegeorgecountyva.gov/news_detail_T6_R2000.php": 9, "https://www.fooddive.com/news/perdue-farms-secrets-to-a-century-in-business/583884/": 8, "https://www.perduefarms.com/en-US/brands-page.html": 7, "https://www.reddit.com/r/Documentaries/comments/5i9kpa/the_very_first_time_a_perdue_chickenfactory/": 26, "https://corporate.perduefarms.com/news/statements/statement-on-wage-and-benefits-lawsuit-settlements/": 24, "https://www.nationalgeographic.com/culture/article/why-perdue-is-moving-towards-happier--and-maybe-healthier--chick": 5, "https://www.sourcewatch.org/index.php/Perdue_Farms": 22, "https://dgllc.net/318-2/": 25, "https://corporate.perduefarms.com/company/legacy/": 23, "https://cychicken.com/article/did-perdue-chicken-go-out-of-business": 31, "https://faculty.salisbury.edu/~mllewis/agriculture/chapter_eight.htm": 2, "https://www.poultryproducer.com/2020-processor-of-the-year-perdue-farms/": 1, "https://projects.apnews.com/features/2023/advertisement-perdue/index.html": 6, "https://en.wikipedia.org/wiki/Frank_Perdue": 3, "https://www.notablebiographies.com/newsmakers2/2006-Le-Ra/Perdue-Frank.html": 27, "https://www.nytimes.com/2005/04/02/obituaries/frank-perdue-84-chicken-merchant-dies.html": 28, "https://foodinstitute.com/focus/perdue-calls-animal-rights-groups-lawsuit-over-fresh-line-labeling-frivolous/": 29, "https://www.encyclopedia.com/social-sciences-and-law/economics-business-and-labor/businesses-and-occupations/perdue-farms-inc": 30, "https://www.perduefoodservice.com/products/brands/perdue-chicken/": 32, "https://www.broilerchickenantitrustlitigation.com/": 33, "https://www.feedstuffs.com/agribusiness-news/poultry-processors-to-pay-180m-in-wage-fixing-class-action": 34, "https://www.cohenmilstein.com/case-study/jien-et-al-v-perdue-farms-inc-et-al/": 35, "https://www.classaction.org/news/poultry-producer-settlements-totaling-nearly-400m-resolve-lawsuit-over-alleged-wage-suppression-conspiracy": 36, "https://www.pressdemocrat.com/article/news/perdue-direct-action-lawsuit/": 40, "https://corporate.perduefarms.com/news/press-releases/petaluma-poultry-takes-legal-action-to-protect-associate-safety-and-privacy-and-curb-aggressive-unlawful-harassment-from-animal-rights-extremist-group-1/": 41, "https://news.maryland.gov/mde/2024/07/31/maryland-department-of-environment-and-perdue-agribusiness-agree-to-12-million-settlement-for-violations-at-salisbury-soybean-facility/": 44, "https://foster-james.com/cases-we-handle/perdue-chicken-farms-water-contamination-lawsuit/": 43, "https://www.vpm.org/news/2025-01-16/perdue-farms-4-million-dollars-child-labor-violations-accomac-chicken-plant": 38, "https://www.reuters.com/legal/government/perdue-farms-labor-department-ink-4-million-deal-child-labor-investigation-2025-01-15/": 39, "https://www.ktvu.com/news/animal-rights-activists-dressed-as-factory-workers-take-chickens-from-petaluma-poultry-facility": 42}, "url_to_info": {"https://business.maryland.gov/news/perdue-celebrates-50-years-of-legendary-brand/": {"url": "https://business.maryland.gov/news/perdue-celebrates-50-years-of-legendary-brand/", "description": "It was 50 years ago that Perdue ... brand in the nation. <strong>After renovating its newly-acquired Route 50 facility in 1967, the company processed its first PERDUE branded chicken right here in Maryland</strong>....", "snippets": ["\"Our administration recognizes the importance of this iconic, family-owned business to Maryland's economy, and I am proud to congratulate the Perdue family on the 50th anniversary of PERDUE branded chicken.\" Also honored at the event were a number of employees celebrating more than 40 years at the Salisbury plant. Together, the workers total more than 300 years of service in Wicomico County. \"The Salisbury plant is successful because of the experience of our associates,\" said chairman Jim Perdue. \"So many people have made a tremendous impact on the growth of our brand and success of our company.\"", "Just this month, the Perdue Foundation donated $20,000 to help clean up the Chesapeake Bay watershed, and earlier this year the foundation funded an early learning center in Berlin and presented a record amount to the United Way of the Lower Eastern Shore, with help from Perdue associates."], "title": "Perdue celebrates 50 years of legendary brand", "meta": {"query": "Perdue Chicken company history"}, "citation_uuid": -1}, "https://2dadswithbaggage.com/the-truth-about-perdue-chicken/": {"url": "https://2dadswithbaggage.com/the-truth-about-perdue-chicken/", "description": "The truth about Perdue Chicken is <strong>positive</strong>, and the company humanely raises poultry in a healthy way for both the chickens and the people that eat them.", "snippets": ["Aditionally, Perdue most likely have dedicated staff to check in on the family farms they partner with. If they weren’t dedicated to providing better environments for their poultry, they wouldn’t bother involving themselves in so many non-profit agencies that promote good welfare, just as other companies do. Just because they are a big organization, doesn’t make them bad. People are in the industry because they care about the animals."], "title": "The Truth About Perdue Chicken - 2 Dads with Baggage", "meta": {"query": "Perdue Chicken brand reputation"}, "citation_uuid": -1}, "https://valdostadailytimes.com/2016/06/29/perdue-to-change-chicken-killing-process/": {"url": "https://valdostadailytimes.com/2016/06/29/perdue-to-change-chicken-killing-process/", "description": "Perdue, which processes nearly 700 million chickens every year at nearly 3,000 farms, announced this week that <strong>it will begin killing chickens using carbon dioxide or argon gas, so they can avoid being hung upside down</strong>.", "snippets": ["Compassion in World Farming, Mercy for Animals and the Humane Society of the United States worked alongside Perdue for the initiative, culling ideas from smaller organic companies that Perdue had acquired. They follow a rise in consumer demand for better slaughterhouse practices."], "title": "Perdue to change chicken-killing process | Valdosta Daily Times", "meta": {"query": "Perdue Chicken controlled atmosphere stunning largest slaughter plant implementation"}, "citation_uuid": -1}, "https://ir.library.louisville.edu/cgi/viewcontent.cgi?article=1778&context=faculty": {"url": "https://ir.library.louisville.edu/cgi/viewcontent.cgi?article=1778&context=faculty", "description": "Perdue’s website routinely points viewers to their animal welfare · reports, featured on their own “Animal Care” tab. We analyze the first five reports- 2016 to · 2020- to substantiate how the company constructs their actions as transparency-publicity to · preclude both accountability for the company, and consumer identification with chickens.2 In", "snippets": ["rhetoric. Though Perdue’s annual releases and commitments to change nominally constitute a · victory for animal welfare advocates, the company’s campaign enacts transparency as a sort of · publicity for the company that belies marginal gains for the lives of chickens and may ultimately", "suffering and the inhumanity of modern industrial animal agriculture, seeing can indeed be · believing because of the capacity for an unmediated gaze upon an animal to spur changed · behavior and identification. In this way, calls for transparency can both (re)structure industrial · practice and alter consumer understandings of their relationship to non-human animals. ... statements on their initiatives. Perdue’s website routinely points viewers to their animal welfare"], "title": "Perdue, animal welfare, and the failure of transparency - ThinkIR", "meta": {"query": "Perdue Chicken controversies"}, "citation_uuid": -1}, "https://aldf.org/article/lawsuit-alleges-usda-fails-to-protect-consumers-from-deceptive-chicken-and-turkey-product-labeling/": {"url": "https://aldf.org/article/lawsuit-alleges-usda-fails-to-protect-consumers-from-deceptive-chicken-and-turkey-product-labeling/", "description": "SAN FRANCISCO — Today, the Animal ... organization for animals, <strong>filed a lawsuit against the U.S. Department of Agriculture (USDA) for allowing producers to use deceptive imagery on poultry products</strong>....", "snippets": ["Yet the agency turned a blind eye toward the misleading graphic imagery and approved Perdue’s false pastoral labels. Consumer concerns over the treatment of animals in animal agriculture have steadily increased over time. A Technomic survey found 77 percent of consumers are concerned about the welfare of animals used for food. More than two-thirds of consumers pay some or a lot of attention to food labeling claims regarding how the animal is raised.", "“Consumers are willing to pay more for higher standards of animal care—and companies like Perdue are taking unfair advantage of consumer sentiment by pushing a false narrative on their packaging.” · In a letter to the Animal Legal Defense Fund, a representative from the Food Safety and Inspection Service, a division of the USDA, asserted that the “photos, colors, and graphics used on packaging are not considered labeling claims.” This statement is in direct opposition to the definitions of “label” and “labeling” in the statutes, which specifically include “graphic matter.”", "Yet the agency turned a blind eye toward the misleading graphic imagery and approved Perdue’s false pastoral labels. Consumer concerns over the treatment of animals in animal agriculture have steadily increased over time. A Technomic survey found 77 percent of consumers are concerned about the welfare of animals used for food. More than two-thirds of consumers pay some or a lot of attention to food labeling claims regarding how the animal is raised. “The USDA has a legal responsibility to ensure animal product sellers are labeling their products accurately,” says Animal Legal Defense Fund Executive Director Stephen Wells."], "title": "Lawsuit Alleges USDA Fails to Protect Consumers from Deceptive Chicken and Turkey Product Labeling - Animal Legal Defense Fund", "meta": {"query": "Perdue Chicken legal issues"}, "citation_uuid": -1}, "https://corporate.perduefarms.com/responsibility/animal-care/programs-practices/": {"url": "https://corporate.perduefarms.com/responsibility/animal-care/programs-practices/", "description": "We’re committed to meeting demand from current and future customers who desire a sustainable supply of chicken that meets all the “2024” animal welfare criteria outlined in the “Joint Animal Protection Agency Statement on Broiler Chicken Welfare Issues” and by the Global Animal ...", "snippets": ["We’re committed to meeting demand from current and future customers who desire a sustainable supply of chicken that meets all the “2024” animal welfare criteria outlined in the “Joint Animal Protection Agency Statement on Broiler Chicken Welfare Issues” and by the Global Animal Partnership. Offering slower-growing breeds with measurably higher welfare outcomes and reduced stocking density. Providing enhanced housing environments, including brighter light, improved litter conditions and enrichments that encourage normal behaviors. Converting from electrical to controlled atmosphere stunning and demonstrating compliance via third-party verification."], "title": "Programs and Practices | Perdue Farms", "meta": {"query": "Perdue Chicken reputation impact animal welfare"}, "citation_uuid": -1}, "https://corporate.perduefarms.com/responsibility/animal-care/": {"url": "https://corporate.perduefarms.com/responsibility/animal-care/", "description": "We are constantly evaluating our programs and policies to ensure that we are continuously improving animal welfare. This means: Increasing enrichment activities: Perdue is funding research and updating chicken houses to explore the impact of elevated enrichments on birds in poultry houses.", "snippets": ["We take a collaborative approach to animal care, adhering to strict requirements under the guidance of a team of veterinarians and animal welfare professionals, and input from third-party experts. Mistreatment or abuse of animals is never tolerated. All associates handling live animals are provided training, including their responsibility to report any violations of our animal welfare policies."], "title": "Animal Care | Perdue Farms", "meta": {"query": "Perdue Chicken reputation impact animal welfare"}, "citation_uuid": -1}, "https://civileats.com/2021/10/14/better-chicken-commitment-fast-food-grocery-giants-promise-sell-better-chicken-is-it-enough-perdue-tyson-cage-free-labeling/": {"url": "https://civileats.com/2021/10/14/better-chicken-commitment-fast-food-grocery-giants-promise-sell-better-chicken-is-it-enough-perdue-tyson-cage-free-labeling/", "description": "Currently, he added, only 10 percent of Perdue’s chicken supply comes from birds slaughtered using CAS. The other component that would represent a significant change for industrial chicken producers is the gradual move away from fast-growing breeds. Fast growth and enlarged breasts in today’s commercial chickens are linked to decreased mobility, skeletal abnormalities, skin lesions, and higher mortality rates. But animal welfare advocates don’t necessarily agree among themselves as to what constitutes a “higher welfare” breed.", "snippets": ["The five-point plan laid out by the Better Chicken Commitment seeks to improve animal welfare, but it's unclear if corporations will honor their commitments."], "title": "Fast Food and Grocery Giants Promise to Sell ‘Better’ Chicken—Is It Enough? | Civil Eats", "meta": {"query": "Perdue Chicken CAS welfare impact on chickens"}, "citation_uuid": -1}, "https://www.theatlantic.com/business/archive/2016/10/perdue-chicken/503423/": {"url": "https://www.theatlantic.com/business/archive/2016/10/perdue-chicken/503423/", "description": "The reaction was swift, with people around the world expressing horror at conditions on the farm, and questioning Perdue’s practices. (Nicholas Kristof, The New York Times’ most ardent defender of chickens, has written about abuses in the industry three times since 2014.)", "snippets": ["In June, Perdue came up with a pledge. The 100-year-old, Maryland-based company said it would improve conditions—for both chickens and humans—in the 2,100 farms that it contracts with, where it raises 640 million birds a year. The reforms have four parts: thinking about the wants and needs of animals, improving relations with the farmers that raise the chickens, being open to criticism of current policies, and continuing to advance its knowledge about animal care."], "title": "Perdue Improves Chicken Conditions - The Atlantic", "meta": {"query": "Perdue Farms chicken treatment criticism"}, "citation_uuid": -1}, "https://en.wikipedia.org/wiki/Perdue_Farms": {"url": "https://en.wikipedia.org/wiki/Perdue_Farms", "description": "The guidelines that Perdue follows, created by the National Chicken Council, have drawn criticism for allowing birds to be deprived of light, food, and water for long periods, and also for permitting animals to be hung upside-down by their ankles before slaughter.", "snippets": ["The company also began contracting with local farmers to raise its birds and supplying chickens for processing as well as opening a second hatchery in North Carolina during this period. Perdue entered the grain and oilseed business by building grain receiving and storage facilities and Maryland's first soybean processing plant. In 1968, the company began operating its first poultry processing plant in Salisbury. This move had two effects: it gave Perdue Farms full vertical integration and quality control over every step from egg and feed to market, as well as increasing profits which were being squeezed by processors."], "title": "Perdue Farms - Wikipedia", "meta": {"query": "Perdue Chicken brand reputation"}, "citation_uuid": -1}, "https://delawarebusinesstimes.com/supplements/perdue-farms-humane/": {"url": "https://delawarebusinesstimes.com/supplements/perdue-farms-humane/", "description": "Keeping chickens’ stress low is good business for Perdue Farms. The calmer the bird, the fewer bruises and abrasions it has, the better it tastes.", "snippets": ["Using all the new systems, theoretically, the birds could go from chick to processing plant without ever being touched by human hands. “It’s much easier on the catcher, on the chicken and on the farm,” says Walston. The system became fully operational in late 2019 in Milford. Over the course of several years, Perdue plans to convert all of its processing plants to CAS systems.", "“It’s much easier on the catcher, on the chicken and on the farm,” says Walston. The system became fully operational in late 2019 in Milford. Over the course of several years, Perdue plans to convert all of its processing plants to CAS systems. ... Business news, analysis and strategic insights on the companies, people and issues that impact business in Delaware and beyond."], "title": "Perdue Farms: Making Chicken Processing More Humane - DBT", "meta": {"query": "Perdue Chicken stress markings"}, "citation_uuid": -1}, "https://www.manufacturingdive.com/news/perdue-farms-seeks-dismiss-pfas-lawsuit-again-Maryland-environment/743529/": {"url": "https://www.manufacturingdive.com/news/perdue-farms-seeks-dismiss-pfas-lawsuit-again-Maryland-environment/743529/", "description": "<strong>Perdue Farms is fighting to toss out a class-action lawsuit alleging that one of its plants in Salisbury, Maryland, contaminated nearby groundwater with PFAS</strong>.", "snippets": ["The agribusiness is cooperating with the Maryland Department of Environment on a way to address possible source contamination at its soybean processing plant."], "title": "Perdue Farms seeks to dismiss PFAS lawsuit again | Manufacturing Dive", "meta": {"query": "Perdue Farms class action lawsuit update"}, "citation_uuid": -1}, "https://www.foodprocessing.com/ingredients/animal-proteins/article/11298502/humane-alternatives-for-poultry-slaughter": {"url": "https://www.foodprocessing.com/ingredients/animal-proteins/article/11298502/humane-alternatives-for-poultry-slaughter", "description": "“Implementation of this CAS system is a significant step in our company’s animal care journey, and <strong>Perdue is the only major poultry company in the country to commit to converting 100 percent of its plants to CAS</strong>,” says Diana Souder, Perdue’s ...", "snippets": ["Controlled atmosphere stunning (CAS) exposes birds to carbon dioxide, usually increasing levels of it in phases to crowd out oxygen. The birds are rendered unconscious but not dead – the optimal condition for bleeding out. Crates of incoming chickens await the destacking module of the Marel Atlas system."], "title": "Humane Alternatives for Poultry Slaughter | Food Processing", "meta": {"query": "Perdue Chicken controlled atmosphere stunning largest slaughter plant implementation"}, "citation_uuid": -1}, "https://corporate.perduefarms.com/responsibility/animal-care/faqs/": {"url": "https://corporate.perduefarms.com/responsibility/animal-care/faqs/", "description": "Our poultry welfare program includes strict procedures, welfare training for associates, regular auditing, video monitoring of areas where live poultry are handled, and USDA inspectors. Our USDA Process Verified Program provides an additional level of assurance, with documentation and reporting that is audited by the USDA. We are committed and actively transitioning to using a multi-stage, dual-gas technology Controlled Atmosphere Stunning (CAS) system to induce insensibility with minimal trauma.", "snippets": ["We are committed and actively transitioning to using a multi-stage, dual-gas technology Controlled Atmosphere Stunning (CAS) system to induce insensibility with minimal trauma. We implemented our first CAS chicken system in Milford, Delaware in 2017 and installed a new system in 2024 at our Dillon, South Carolina harvest plant."], "title": "Frequently Asked Questions | Perdue Farms", "meta": {"query": "Perdue Chicken CAS welfare impact on chickens"}, "citation_uuid": -1}, "https://www.princegeorgecountyva.gov/news_detail_T6_R2000.php": {"url": "https://www.princegeorgecountyva.gov/news_detail_T6_R2000.php", "description": "Perdue Foods is recalling <strong>31,703 pounds of ready-to-eat chicken products that may be contaminated with pieces of “bone material,”</strong> the US Department of Agriculture’s Food Safety and Inspection Service announced Friday.", "snippets": ["“We are committed to producing the highest quality products, therefore, out of an abundance of caution, we have decided to recall all affected products that were produced during the same production run,” Jeff Shaw, Perdue’s vice president of food safety and quality, said in a statement. Last month, Tyson Foods expanded their recall on more than 11.8 million pounds of frozen, ready-to-eat chicken strip products over concerns that some might be contaminated with pieces of metal."], "title": "Perdue recalls chicken tenders, nuggets, strips, and patties due to possible contamination", "meta": {"query": "Perdue Farms frozen chicken tenders contamination"}, "citation_uuid": -1}, "https://www.fooddive.com/news/perdue-farms-secrets-to-a-century-in-business/583884/": {"url": "https://www.fooddive.com/news/perdue-farms-secrets-to-a-century-in-business/583884/", "description": "Perdue Farms, one of the nation&#x27;s ... come. <strong>Jim Perdue, the 70-year-old chairman of Perdue who has been in the role since 1991, is the grandson of founder Arthur Perdue who founded the Maryland company a hundred years ago</strong>...", "snippets": ["Its most recent acquisition was Maxi Canada in late 2019, a frozen nugget manufacturer that recently added a product containing both chicken and vegetables. These acquisitions, and innovation within its own product offerings, have enabled Perdue to achieve a larger presence in premium products compared to its competitors who have largely skewed toward mainstream, mass-produced items, Perdue said."], "title": "Perdue Farms' secrets to a century in business | Food Dive", "meta": {"query": "Perdue Chicken company history"}, "citation_uuid": -1}, "https://www.perduefarms.com/en-US/brands-page.html": {"url": "https://www.perduefarms.com/en-US/brands-page.html", "description": "We’re <strong>recognized as the first to successfully market chicken by branding and advertising a product measurably superior to the competition</strong>, and we’ve been innovating ever since.", "snippets": ["NO ANTIBIOTICS EVER: Our premium brands are leaders in no-antibiotics-ever chicken, turkey, pork, beef and lamb and in USDA-certified organic chicken and beef. We’re also proud to feature a growing portfolio of heritage-breed, pastured and grass-fed products. SUSTAINABILITY: We've increased our support for family farms by creating new markets, supporting organic production and giving farmers products and services that increase the sustainability of conventional agriculture. The Perdue brand is the No."], "title": "Our Brands | Perdue Farms", "meta": {"query": "Perdue Chicken brand reputation"}, "citation_uuid": -1}, "https://www.reddit.com/r/Documentaries/comments/5i9kpa/the_very_first_time_a_perdue_chickenfactory/": {"url": "https://www.reddit.com/r/Documentaries/comments/5i9kpa/the_very_first_time_a_perdue_chickenfactory/", "description": "Corporations (like Perdue) are disturbingly sociopathic in their ability to exploit the gap between the letter and the intention of a regulation or marketing statement. We&#x27;ve seen that they technically have fulfilled their promise of raising cage-free chickens while still abusing them terribly.", "snippets": ["Corporations (like Perdue) are disturbingly sociopathic in their ability to exploit the gap between the letter and the intention of a regulation or marketing statement. We've seen that they technically have fulfilled their promise of raising cage-free chickens while still abusing them terribly."], "title": "r/Documentaries on Reddit: The very first time a \"Perdue\" chicken-factory farmer allows film crew inside the farm to reveal the cruelty on chickens and the despicable conditions they are rapidly raised in. (2014)", "meta": {"query": "Perdue Chicken controversies"}, "citation_uuid": -1}, "https://corporate.perduefarms.com/news/statements/statement-on-wage-and-benefits-lawsuit-settlements/": {"url": "https://corporate.perduefarms.com/news/statements/statement-on-wage-and-benefits-lawsuit-settlements/", "description": "<strong>Perdue agreed to settle two lawsuits in Maryland and Colorado</strong> brought by private class-action plaintiffs who alleged the company improperly shared wage and benefits information.", "snippets": ["For more than a century, and across four generations of Perdue leadership, we’ve put people first."], "title": "Statement on Wage and Benefits Lawsuit Settlements", "meta": {"query": "Perdue Farms class action lawsuit update"}, "citation_uuid": -1}, "https://www.nationalgeographic.com/culture/article/why-perdue-is-moving-towards-happier--and-maybe-healthier--chick": {"url": "https://www.nationalgeographic.com/culture/article/why-perdue-is-moving-towards-happier--and-maybe-healthier--chick", "description": "Those changes come as the company is also committing to converting its processing plants to using a system to gas birds into unconsciousness before they are shackled upside-down and sent along the slaughter line. That method, known as “controlled atmosphere” stunning or killing, is used widely in Europe but in the United States only by companies smaller than Perdue, such as Mary’s Free Range Chickens and Bell &amp; Evans.", "snippets": ["It contains four significant changes, which Perdue leadership explained in advance to The Plate: new standards for how birds are raised and slaughtered; an increased voice for its contract farmers; a transparency initiative that includes annual publishing of metrics; and creation of an “animal care culture” that includes new executive positions."], "title": "Why Perdue Will Grow Happier (and Maybe Healthier) Chickens | National Geographic", "meta": {"query": "Perdue Chicken controlled atmosphere stunning largest slaughter plant implementation"}, "citation_uuid": -1}, "https://www.sourcewatch.org/index.php/Perdue_Farms": {"url": "https://www.sourcewatch.org/index.php/Perdue_Farms", "description": "1 Controversies · 1.1 Class Action ... · 3 Contact Information · 4 References · <strong>A consumer class action lawsuit alleges that Perdue Farms, Inc. has misled consumers by advertising its Harvestland brand of chickens as &quot;humane.&quot;</strong>...", "snippets": ["Dr. James A. Perdue, Chairman and Chief Executive Officer"], "title": "Perdue Farms - SourceWatch", "meta": {"query": "Perdue Chicken controversies"}, "citation_uuid": -1}, "https://dgllc.net/318-2/": {"url": "https://dgllc.net/318-2/", "description": "DeBlasio Law Group, LLC has learned that The Humane Society of the United States announced the filing of a class action lawsuit against the nation’s third-largest poultry producer, Perdue Farms, over the company’s alleged false advertising practices of factory farmed chicken products as “humane.” The suit—filed by an HSUS member on behalf of consumers duped by Perdue Farms—alleges that Perdue is illegally marketing its “Harvestland” and “Perdue” chicken products with “Humanely Raised” labels in violation of the New Jersey Consumer Fraud Act.", "snippets": ["DeBlasio Law Group Obtains Settlement in Lawsuit Involving Fraudulent Inducement to Execute Promissory Note and Sale of Equity Stake in LLC Franchise. The Importance of Beneficiary Designations in Retirement Accounts: Ex-Wife Prevails in Securing Ex-Husband’s Retirement Funds ... DeBlasio Law Group, LLC has learned that The Humane Society of the United States announced the filing of a class action lawsuit against the nation’s third-largest poultry producer, Perdue Farms, over the company’s alleged false advertising practices of factory farmed chicken products as “humane.” The suit—filed by an HSUS member on behalf of consumers duped by Perdue Farms—alleges that Perdue is illegally marketing its “Harvestland” and “Perdue” chicken products with “Humanely Raised” labels in violation of the New Jersey Consumer Fraud Act."], "title": "Perdue Farms Faces Lawsuit Over \"Humanely Raised\" Labeling of Products. - DeBlasio Law Group, LLC", "meta": {"query": "Perdue Farms class action lawsuit update"}, "citation_uuid": -1}, "https://corporate.perduefarms.com/company/legacy/": {"url": "https://corporate.perduefarms.com/company/legacy/", "description": "The company’s first TV commercial aired in the early ’70s and introduced Frank Perdue, the first company leader to successfully serve as an advertising spokesman in a major branding campaign. The company’s now-famous slogan, “It takes a tough man to make a tender chicken®,” helped make PERDUE® a household name.", "snippets": ["Jim is guiding the company in its second century of ownership by holding fast to the values he inherited from his grandfather and father and responding to consumers and other stakeholders. As a result, Perdue Farms has become the first major company to move away from all routine antibiotic use, the number one producer of USDA certified chicken and a leader in improving animal care."], "title": "Perdue Family | Perdue Farms", "meta": {"query": "Perdue Chicken brand reputation"}, "citation_uuid": -1}, "https://cychicken.com/article/did-perdue-chicken-go-out-of-business": {"url": "https://cychicken.com/article/did-perdue-chicken-go-out-of-business", "description": "The company continues to operate under the leadership of the Perdue family, maintaining its reputation for quality and ethical practices. Recent searches or rumors suggesting otherwise may stem from misinformation or confusion with other brands, but Perdue Chicken remains a thriving and active business in the food industry.", "snippets": ["For instance, Perdue could issue clear statements during supply disruptions or explain strategic shifts in accessible language. Consumers, meanwhile, should verify information through credible sources before sharing it. By fostering transparency and critical thinking, both parties can mitigate the impact of unfounded rumors and maintain trust in established brands.", "While some regional brands have faced closures due to economic pressures or supply chain disruptions, Perdue’s scale and diversification have allowed it to weather challenges. For example, during the COVID-19 pandemic, Perdue adapted by increasing e-commerce capabilities and ensuring consistent supply to retailers, showcasing its agility in crisis management. This adaptability is a key factor in its continued success. In conclusion, Perdue Chicken is not only alive and well but thriving through innovation and responsiveness to market trends."], "title": "Is Perdue Chicken Still In Business? Debunking The Closure Rumors | CyChicken", "meta": {"query": "Impact of controversies on Perdue Chicken brand reputation"}, "citation_uuid": -1}, "https://faculty.salisbury.edu/~mllewis/agriculture/chapter_eight.htm": {"url": "https://faculty.salisbury.edu/~mllewis/agriculture/chapter_eight.htm", "description": "Arthur Perdue believed businesses should be run on the principles of honesty, integrity, and quality[ii]. <strong>The company continued in 1925 when he built his first hatchery</strong>. Before the 1930’s, marketing chickens for consumption was a byproduct of egg production for Arthur.", "snippets": ["This move allowed Perdue to increase profits by not actually growing the birds themselves and it began the company’s vertical integration climb.[v] Vertical Integration is best defined as the process in which several steps in the production and/or distribution of a product or service are controlled by a single company or entity, in order to increase that company's or entity's power in the marketplace. Perdue grew in 1958 with the construction of its own feed mill in Salisbury, continuing in the path of vertical integration. This state of the art plant was at the time, one of the largest grai", "Arthur Perdue believed businesses should be run on the principles of honesty, integrity, and quality[ii]. The company continued in 1925 when he built his first hatchery. Before the 1930’s, marketing chickens for consumption was a byproduct of egg production for Arthur."], "title": "Chapter Eight Perdue", "meta": {"query": "Perdue Chicken company history"}, "citation_uuid": -1}, "https://www.poultryproducer.com/2020-processor-of-the-year-perdue-farms/": {"url": "https://www.poultryproducer.com/2020-processor-of-the-year-perdue-farms/", "description": "<strong>They originally sold eggs from a small flock of chickens housed in the backyard of their now-iconic farmhouse in Salisbury</strong>. In 1925, they built the company’s first hatchery, and began selling layer chicks to farmers.", "snippets": ["The company was founded in 1920 by Arthur Perdue and his wife, Pearl. They originally sold eggs from a small flock of chickens housed in the backyard of their now-iconic farmhouse in Salisbury. In 1925, they built the company’s first hatchery, and began selling layer chicks to farmers."], "title": "2020 Processor of the Year: Perdue Farms - Poultry Producer", "meta": {"query": "Perdue Chicken company history"}, "citation_uuid": -1}, "https://projects.apnews.com/features/2023/advertisement-perdue/index.html": {"url": "https://projects.apnews.com/features/2023/advertisement-perdue/index.html", "description": "<strong>When Arthur Perdue started the family business, the poultry industry was smaller and simpler; the farm was the only place to hatch a chick</strong>. Over the decades, as both Perdue and a hungry world population grew, everything has gotten bigger — ...", "snippets": ["Today, Perdue’s leaders continue to grow the company while continuously improving how they raise chickens. Sometimes the changes harken back to Arthur Perdue’s time, but today’s leaders now leverage science and technology unknown in those early days."], "title": "The Seeds of Change", "meta": {"query": "Perdue Chicken company history"}, "citation_uuid": -1}, "https://en.wikipedia.org/wiki/Frank_Perdue": {"url": "https://en.wikipedia.org/wiki/Frank_Perdue", "description": "Frank Perdue&#x27;s promotion of the Perdue brand through high-profile advertising resulted in its being the first well-known brand of chicken in the U.S. Perdue Farms developed a specialized chicken-feed that included marigold blossoms, which imparted a characteristic golden yellow hue to the skins of his chickens. In the 1980s, Perdue twice sought assistance from then-Mafia boss Paul Castellano to fend off a union&#x27;s effort to represent workers at his company, according to a federal commission on labor corruption.", "snippets": ["In 1991, Frank Perdue was honored with an Edison Achievement Award for his commitment to innovation throughout his career. Frank Perdue was a patron of treasure hunter Mel Fisher, helping fund his expedition to locate the wreckage of the Spanish galleon Nuestra Señora de Atocha, which had sunk off the coast of the Florida Keys in 1622."], "title": "Frank Perdue - Wikipedia", "meta": {"query": "Perdue Chicken company history"}, "citation_uuid": -1}, "https://www.notablebiographies.com/newsmakers2/2006-Le-Ra/Perdue-Frank.html": {"url": "https://www.notablebiographies.com/newsmakers2/2006-Le-Ra/Perdue-Frank.html", "description": "They switched to raising chickens ... meat prices climbed during World War II, and the business grew steadily over the next decade. <strong>Perdue became president of the company in 1952</strong>, and continued to oversee the Perdue Farms expansion plan....", "snippets": ["It was Perdue's determination to launch a national advertising campaign, however, that turned the company into a nationally known brand. In the early 1970s, he met with several dozen advertising agencies before hiring one that agreed with his plan for a campaign, but he was told that the commercials required a humorous approach, and that he needed to personally convey why his packaged supermarket chicken was better than the rest."], "title": "Frank Perdue Biography - family, children, parents, name, wife, son, born, college, time - Newsmakers Cumulation", "meta": {"query": "Perdue Chicken company history"}, "citation_uuid": -1}, "https://www.nytimes.com/2005/04/02/obituaries/frank-perdue-84-chicken-merchant-dies.html": {"url": "https://www.nytimes.com/2005/04/02/obituaries/frank-perdue-84-chicken-merchant-dies.html", "description": "<strong>The Perdue innovations in production, marketing and advertising were imitated in the poultry business and contributed to its consolidation</strong>. After the chickens were hatched at the Perdue Farms, they were sent to hundreds of contract farms to ...", "snippets": ["In the 1970's, Mr. Perdue started the ad campaigns that would make him famous. He appeared in 200 different ads from 1971 to 1994. It helped that he looked like a chicken. And Ross Perot. And Edward I. Koch, the mayor of New York. His bald head, droopy-eyed expression and prominent nose made people smile and feel comfortable with him."], "title": "Frank Perdue, 84, Chicken Merchant, Dies - The New York Times", "meta": {"query": "Perdue Chicken notable milestones and achievements"}, "citation_uuid": -1}, "https://foodinstitute.com/focus/perdue-calls-animal-rights-groups-lawsuit-over-fresh-line-labeling-frivolous/": {"url": "https://foodinstitute.com/focus/perdue-calls-animal-rights-groups-lawsuit-over-fresh-line-labeling-frivolous/", "description": "Perdue Farms labeled “frivolous” ... by the Animal Legal Defense Fund alleging <strong>FSIS allowed Perdue to use misleading labels on its Fresh Line chicken and turkey products</strong>....", "snippets": ["The contemporary design has playful illustrations and vibrant colors, and highlights trusted product attributes like no-antibiotics-ever, 100-percent vegetarian diets with no animal by-products, raised cage free, and with no hormones or steroids,” Perdue said in an email to The Food Institute. “This re-brand is 3 years old and only our fourth major packaging update in the history of the brand. At the time of the update, we did a comprehensive consumer survey that showed there was no misrepresentation on our packaging.” · The lawsuit, however, alleges the labeling approved by FSIS depicted chicken and turkeys roaming freely outdoors when in reality they were in warehouses on factory farms.", "“Consumers are willing to pay more for higher standards of animal care – and companies like Perdue are taking unfair advantage of consumer sentiment by pushing a false narrative on their packaging.” · Laurie Beyranevend, director of the Center for Agriculture and Food Systems at Vermont Law School, said she thinks depictions on labels, whether photos or drawings, can, indeed mislead consumers. “The particular labels at issue depict chickens and turkeys in what appears to be a green field with a fence, a barn, and some clouds suggesting the animals are outside at some point in their lives when in fact, the poultry at issue has been raised entirely indoors,” she said in an email.", "The lawsuit charges the FSIS with failing to consider the imagery conveyed on labels, concentrating instead on product statements and claims, to the detriment of consumers. It accuses the agency of “turning a blind eye to Perdue’s Fresh Line label imagery [allowing] the company to mislead consumers with images that falsely represent that chickens and turkeys sold as Perdue products were afforded access to the outdoors.”", "The complaint adds: “Defendants’ actions enabling Perdue and other sellers to mislead consumers about the treatment and living conditions of chickens and turkeys used for their products impede and frustrate ALDF’s mission-driven activities to curtail the inhumane, large-scale confinement of these birds.”"], "title": "Perdue Calls Animal Rights Group’s Lawsuit Over Fresh Line Labeling ‘Frivolous’ - The Food Institute", "meta": {"query": "Perdue Chicken legal issues"}, "citation_uuid": -1}, "https://www.encyclopedia.com/social-sciences-and-law/economics-business-and-labor/businesses-and-occupations/perdue-farms-inc": {"url": "https://www.encyclopedia.com/social-sciences-and-law/economics-business-and-labor/businesses-and-occupations/perdue-farms-inc", "description": "Private Company Incorporated: 1920 Employees: 12,500 Sales: $1.2 billion SICs: 2015 Poultry Slaughtering &amp; Processing; 2048 Prepared Feeds Nec; 2075 Soybean Oil Mills · <strong>“My chickens eat better than you do.” As one of the many snappy advertising slogans used by Perdue Farms since the late 1960s</strong>...", "snippets": ["Marketing professors often explain this approach to students by asking them to explain their brand in a single word or phrase. In this way American consumers have come to understand that the Nike brand translates into athletic achievement, BMW is \"the ultimate driving machine,\" and, in this case, Perdue stands for freshness and safety."], "title": "Perdue Farms Inc | Encyclopedia.com", "meta": {"query": "Perdue Chicken company history"}, "citation_uuid": -1}, "https://www.perduefoodservice.com/products/brands/perdue-chicken/": {"url": "https://www.perduefoodservice.com/products/brands/perdue-chicken/", "description": "Perdue foodservice has restaurant poultry products including <strong>ABF, antibiotic free chicken, sausage, whole birds</strong> along with full product specs, nutritional information and culinary - recipe ideas.", "snippets": ["PRODUCTS · BRANDS · PERDUE® CHICKEN · ALL MENU CLAIMS ARE THIRD-PARTY VERIFIED FOR COMPLETE TRUST AND TRANSPARENCY. Greek Chicken Bowl · GET RECIPE ·"], "title": "Perdue® Chicken | Perdue Foodservice", "meta": {"query": "Perdue Chicken key products"}, "citation_uuid": -1}, "https://www.broilerchickenantitrustlitigation.com/": {"url": "https://www.broilerchickenantitrustlitigation.com/", "description": "Additional settlements – referred to in this notice as the New Settlements – have been reached in a class action antitrust lawsuit filed on behalf of Direct Purchaser Plaintiffs (“Plaintiffs”) of Broiler chicken. The new settlements are with Defendants: ● House of Raeford Farms, Inc. (“HRF”); ● Koch Foods, Inc.; JCG Foods of Alabama, LLC; JCG Foods of Georgia, LLC; and Koch Meat Co., Inc. (collectively, “Koch”); ● Foster Farms, LLC and Foster Poultry Farms LLC (collectively, “Foster Farms”); ● Perdue Farms, Inc. and Perdue Foods LLC (collectively, “Perdue”); ● Case Foods, Inc., Case Farms Processing, Inc., and Case Farms, LLC (collectively, “Case”); ● Norman W.", "snippets": ["The Court has now preliminarily approved the New Settlements with HRF, Koch, Foster Farms, Perdue, Case, Claxton, Wayne Farms, Agri Stats, and Sanderson Farms. If the Court gives final approval to these New Settlements, it will resolve the litigation in full between the Plaintiffs and all Defendants. Your legal rights are affected whether you act or don’t act.", "Plaintiffs allege that Defendants implemented their conspiracy in various ways, including via coordinated supply restrictions, sharing competitively sensitive price and production information, and otherwise manipulating Broiler prices, with the intent and expected result of increasing prices of Broilers in the United States, in violation of federal antitrust laws. Defendants deny the violation and deny causing damages. The Court previously gave final approval to settlements between the Plaintiffs and Tyson, Pilgrim’s Pride, Fieldale Farms, Peco, George’s, Amick, Mar-Jac, Harrison Poultry, Simmons, Mountaire, and O.K. Foods. The Court has now preliminarily approved the New Settlements with HRF, Koch, Foster Farms, Perdue, Case, Claxton, Wayne Farms, Agri Stats, and Sanderson Farms."], "title": "In re Broiler Chicken Antitrust Litigation", "meta": {"query": "Perdue Chicken CAS legal standing"}, "citation_uuid": -1}, "https://www.feedstuffs.com/agribusiness-news/poultry-processors-to-pay-180m-in-wage-fixing-class-action": {"url": "https://www.feedstuffs.com/agribusiness-news/poultry-processors-to-pay-180m-in-wage-fixing-class-action", "description": "23 in the U.S. District Court for ... Perdue Farms et al., which was first filed in 2019 and <strong>alleges that 18 chicken companies and two consulting firms – Agri Stats Inc.</strong>...", "snippets": ["The lawsuit claimed that most of the poultry processing line workers were paid wages near or below the poverty line and that the companies intentionally targeted vulnerable populations for their workforce, such as migrants and refugees."], "title": "Poultry processors to pay $180M in wage-fixing class action", "meta": {"query": "Perdue Chicken wage suppression accusations lawsuit details"}, "citation_uuid": -1}, "https://www.cohenmilstein.com/case-study/jien-et-al-v-perdue-farms-inc-et-al/": {"url": "https://www.cohenmilstein.com/case-study/jien-et-al-v-perdue-farms-inc-et-al/", "description": "Cohen Milstein represents poultry ... Farms Inc., Tyson Foods Inc., and others, <strong>conspired to suppress their compensation, since 2019, in violation of federal antitrust laws</strong>....", "snippets": ["Jien, et al. v. Perdue Farms, Inc., et al. (D. Md.): Cohen Milstein serves as Co-Lead Counsel in this putative wage and hour suppression class action against…"], "title": "Jien, et al. v. Perdue Farms, Inc., et al. - Cohen Milstein", "meta": {"query": "Perdue Chicken legal issues"}, "citation_uuid": -1}, "https://www.classaction.org/news/poultry-producer-settlements-totaling-nearly-400m-resolve-lawsuit-over-alleged-wage-suppression-conspiracy": {"url": "https://www.classaction.org/news/poultry-producer-settlements-totaling-nearly-400m-resolve-lawsuit-over-alleged-wage-suppression-conspiracy", "description": "A collective of the largest chicken producers in the industry has been hit with a proposed class action lawsuit centered on an alleged conspiracy among the companies to fix and suppress competition among employees. ... Agri Stats, Inc. Tyson Foods, Inc. Sanderson Farms Inc. George&#x27;s, Inc. Tyson Fresh Meats, Inc. Perdue Farms, Inc.", "snippets": ["A slew of major chicken producers have agreed to settlements totaling more than $398 million that will resolve a class action over an alleged conspiracy to suppress employee wages."], "title": "Poultry Producer Settlements Totaling Nearly $400M Resolve Lawsuit Over Alleged Wage-Suppression Conspiracy", "meta": {"query": "Perdue Chicken settlements"}, "citation_uuid": -1}, "https://www.pressdemocrat.com/article/news/perdue-direct-action-lawsuit/": {"url": "https://www.pressdemocrat.com/article/news/perdue-direct-action-lawsuit/", "description": "After the Jan. 28 protest, according to Perdue, DxE littered Arnold’s neighborhood with flyers showing his image and stating, “Your Neighbor, Jason Arnold . . . oversee[s] the killing of 49,000 chickens per day.”", "snippets": ["“Perdue is using its multibillion-dollar revenue to file what attorneys have told us is an obvious SLAPP suit, a strategic lawsuit against public participation, which corporations routinely use to crush free speech through expensive litigation,” a Direct Action Everywhere representative wrote. “The complaint is full of false accusations meant to malign nonviolent activists and keep the public in the dark about its animal cruelty.”"], "title": "Perdue Foods goes to court to block animal rights activists from protesting at poultry exec’s Santa Rosa home", "meta": {"query": "Perdue Chicken controversies"}, "citation_uuid": -1}, "https://corporate.perduefarms.com/news/press-releases/petaluma-poultry-takes-legal-action-to-protect-associate-safety-and-privacy-and-curb-aggressive-unlawful-harassment-from-animal-rights-extremist-group-1/": {"url": "https://corporate.perduefarms.com/news/press-releases/petaluma-poultry-takes-legal-action-to-protect-associate-safety-and-privacy-and-curb-aggressive-unlawful-harassment-from-animal-rights-extremist-group-1/", "description": "Petaluma, California – April 4, ... of an associate and his family amid <strong>repeated harassment and privacy violations by the radical animal rights group Direct Action Everywhere (DxE).</strong>...", "snippets": ["Today, we took steps to protect those values for our associates, their families and our community,” said Julie Katigan, Chief Human Resources Officer for Perdue. “While we welcome open and honest discussion about the welfare of animals, we strongly oppose the extreme tactics used by DxE,” Katigan added."], "title": "Petaluma Poultry takes legal action to protect associate ...", "meta": {"query": "Perdue Chicken legal issues"}, "citation_uuid": -1}, "https://news.maryland.gov/mde/2024/07/31/maryland-department-of-environment-and-perdue-agribusiness-agree-to-12-million-settlement-for-violations-at-salisbury-soybean-facility/": {"url": "https://news.maryland.gov/mde/2024/07/31/maryland-department-of-environment-and-perdue-agribusiness-agree-to-12-million-settlement-for-violations-at-salisbury-soybean-facility/", "description": "“I am glad that Perdue has accepted responsibility and will be investing in the surrounding neighborhoods moving forward.” “Salisbury, Maryland is our home, where our family-owned company was founded over 100 years ago,” said Kevin McAdams, Perdue Farms CEO. “We are proud to have an annual economic impact of $1.6 billion in the state of Maryland. While we have made some missteps along the way, we take full accountability, as reflected in today’s settlement agreement. We have taken substantial actions to ensure we have the proper controls in place to prevent this from happening again.” The settlement terms include:", "snippets": ["More than $3.5 million in onsite pollution reduction actions, including electrifying heavy diesel equipment · $400,000 to the City of Salisbury to fund a terrascaping project and plant trees in areas with poor tree canopies · Perdue is based on the Eastern Shore of Maryland and owns and operates food, grain, and oilseed businesses."], "title": "Maryland", "meta": {"query": "Perdue Farms class action lawsuit update"}, "citation_uuid": -1}, "https://foster-james.com/cases-we-handle/perdue-chicken-farms-water-contamination-lawsuit/": {"url": "https://foster-james.com/cases-we-handle/perdue-chicken-farms-water-contamination-lawsuit/", "description": "Recent concerns have emerged regarding <strong>alleged toxic chemical emissions</strong> from Perdue chicken processing plants in North Georgia and Maryland, which may have contaminated local water sources and contributed to serious health issues, including ...", "snippets": ["The Environmental Protection Agency (EPA) has proposed stricter regulations on PFAS in drinking water, and lawsuits nationwide are targeting companies responsible for contamination. Recently, Perdue has faced penalties for environmental violations in other regions, including a $12 million settlement for air pollution in Maryland, signaling a pattern of regulatory challenges.", "If you suspect your cancer or health issues are related to water contamination near a Perdue facility, contact us immediately for a free, confidential consultation. The health and well-being of North Georgia residents are at stake. At Foster James, LLC, we believe no one should suffer due to corporate negligence. If you or a loved one has been diagnosed with thyroid cancer, kidney cancer, or another condition potentially linked to toxic chemicals from Perdue’s chicken plants, we are here to help you seek justice."], "title": "Perdue Chicken Water Contamination Lawsuit (May Update)", "meta": {"query": "Perdue Chicken legal issues"}, "citation_uuid": -1}, "https://www.vpm.org/news/2025-01-16/perdue-farms-4-million-dollars-child-labor-violations-accomac-chicken-plant": {"url": "https://www.vpm.org/news/2025-01-16/perdue-farms-4-million-dollars-child-labor-violations-accomac-chicken-plant", "description": "Perdue Farms is under investigation for <strong>violating federal child labor laws</strong>, an investigation prompted by stories from its plant on Virginia’s Eastern Shore.", "snippets": ["In 2024, Department of Labor investigators found Perdue and SMX employed children as far back as 2020 in what it called hazardous conditions at Perdue’s Accomac plant."], "title": "Perdue agrees to pay $4 million for child labor violations at Accomac plant", "meta": {"query": "Perdue Chicken controversies"}, "citation_uuid": -1}, "https://www.reuters.com/legal/government/perdue-farms-labor-department-ink-4-million-deal-child-labor-investigation-2025-01-15/": {"url": "https://www.reuters.com/legal/government/perdue-farms-labor-department-ink-4-million-deal-child-labor-investigation-2025-01-15/", "description": "<strong>Perdue will pay $4 million in restitution and a $150,000 civil penalty</strong> to settle a investigation that found children at the Accomac, Virginia, plant used dangerous equipment including electric knives and a heat-sealing press and worked past ...", "snippets": ["Along with the payouts, the Labor Department said Perdue and SMX had agreed not to hire anyone under the age of 18 in certain locations, to provide mandatory training on child labor, and establish dedicated tip lines for employees to report compliance issues, among other measures. The department on Monday announced a separate $4 million agreement with meatpacker JBS that will be used to assist individuals and communities affected by unlawful child labor practices nationwide. JBS was not accused of wrongdoing, but the Labor Department said the company contracted with third-party service providers who employed children in dangerous jobs at facilities in four states."], "title": "Perdue Farms, Labor Department ink $4 million deal in child labor investigation | Reuters", "meta": {"query": "Perdue Chicken wage suppression accusations lawsuit details"}, "citation_uuid": -1}, "https://www.ktvu.com/news/animal-rights-activists-dressed-as-factory-workers-take-chickens-from-petaluma-poultry-facility": {"url": "https://www.ktvu.com/news/animal-rights-activists-dressed-as-factory-workers-take-chickens-from-petaluma-poultry-facility", "description": "In a statement to KTVU, Perdue denied the allegations and blasted the protesters&#x27; actions as dangerous to themselves, to the factory employees, and to the animals. &quot;The safety of our associates and the welfare of the animals in our care is our top priority,&quot; said Perdue Farms Chief Animal Care Officer and Farmer Relationship Advocate Mike Levengood.", "snippets": ["In a statement to KTVU, Perdue denied the allegations and blasted the protesters' actions as dangerous to themselves, to the factory employees, and to the animals. \"The safety of our associates and the welfare of the animals in our care is our top priority,\" said Perdue Farms Chief Animal Care Officer and Farmer Relationship Advocate Mike Levengood."], "title": "Animal rights activists, dressed as factory workers, take chickens from Petaluma Poultry facility | KTVU FOX 2", "meta": {"query": "Perdue Chicken animal welfare criticism incidents"}, "citation_uuid": -1}}}