{"url_to_unified_index": {"https://www.terrafirmamagazine.com/case-studies/caribou-coffee/": 11, "https://www.bbc.com/news/articles/c4g4y4gwjpeo": 9, "https://www.hr-brew.com/stories/2026/02/17/hr-leaders-ice-minneapolis-resources": 10, "https://www.threads.com/@ensley74/post/DTVD1lTDfMd/caribou-coffees-has-instructed-their-employees-not-to-refuse-service-to-ice": 12, "https://blog.osum.com/caribou-coffee-financial-analysis/": 13, "https://www.startribune.com/minneapolis-foundation-small-business-grant-immigration-ice-ceo-letter/601571704": 3, "https://www.reuters.com/business/retail-consumer/small-minneapolis-businesses-hit-hard-by-ice-crackdown-while-corporations-stay-2026-01-16/": 1, "https://www.nytimes.com/2026/01/23/us/minnesota-businesses-protest-ice.html": 2, "https://pitchbook.com/profiles/company/12887-11": 22, "https://www.fox9.com/news/ice-surge-hits-twin-cities-businesses-revenue-loss-reported-jan-2026": 21, "https://mspmag.com/shop-and-style/mn-retailers-respond-ice-raids-mutual-aid-fundraising-economic-blackout/": 15, "https://www.sec.gov/Archives/edgar/data/1332602/000095014406002979/g00301e10vk.htm": 23, "https://www.twincities.com/2026/02/04/heres-how-to-support-small-businesses-in-twin-cities-impacted-by-ice-surge/": 24, "https://spokesman-recorder.com/2026/01/23/ice-activity-impacts-local-businesses/": 16, "https://minnesotanonprofits.org/community-resources-ice-operations": 25, "https://minnesotanonprofits.org/ice-resources": 26, "https://mncdficoalition.org/ice-response/": 18, "https://www.reddit.com/r/TwinCities/comments/1q8fwdf/caribou_coffee_panera_bread_ice/": 4, "https://en.wikipedia.org/wiki/Operation_Metro_Surge": 5, "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-tuesday-feb-10": 8, "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-thursday-feb-5": 7, "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-monday-feb-2": 6, "https://newrepublic.com/article/205446/minneapolis-faith-leaders-response-ice": 20, "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-tuesday-feb-17": 19, "https://finance-commerce.com/2026/01/minneapolis-businesses-silent-ice-raids/": 14, "https://kstp.com/kstp-news/top-news/ice-presence-chills-business-cancels-events-in-twin-cities/": 17}, "url_to_info": {"https://www.terrafirmamagazine.com/case-studies/caribou-coffee/": {"url": "https://www.terrafirmamagazine.com/case-studies/caribou-coffee/", "description": "“We’re always pushing the envelope here at Caribou Coffee; we want to evolve our tea, caramel and sandwich lines,” reveals Tattersfield when asked about the company’s philosophy toward upgrading its product platforms. “We want to offer tastes appealing to the younger generation and deliver a high-quality food product in a high-experience environment.” · At the core of operations is a dedication to providing a community place that is fun, passionate, authentic, fair, accepting, responsible, and deeply involved in listening, recognizing and developing innovative, quality items that connect with guests and the company team.", "snippets": ["Caribou Coffee is dedicated to having a positive impact on more than just taste buds."], "title": "Caribou Coffee - Terra Firma", "meta": {"query": "Impact of ICE on Caribou Coffee operations"}, "citation_uuid": -1}, "https://www.bbc.com/news/articles/c4g4y4gwjpeo": {"url": "https://www.bbc.com/news/articles/c4g4y4gwjpeo", "description": "Federal agents shot and killed two US citizens in Minneapolis last month, and migrants with clean records and US citizens have been caught up in the crackdown. Workplaces have emerged as a key battleground, as officers use them to make detentions. Anti-ICE activists have responded with protests aimed at businesses, including Target, Home Depot, DR Horton and the Hilton hotel chain.", "snippets": ["Employees are pushing firms to provide clearer guidance about how to respond if Immigration and Customs Enforcement (ICE) officers arrive at their worksites - and asking them to do more to limit agents' access to stores and parking lots. The pressures have been particularly acute at Target, a national name and one of the state's flagship employers, after the detention of two workers inside one of its suburban Minneapolis stores last month."], "title": "Why Target is under fire over Minnesota ICE raids", "meta": {"query": "Effects of ICE raids on businesses in Minneapolis"}, "citation_uuid": -1}, "https://www.hr-brew.com/stories/2026/02/17/hr-leaders-ice-minneapolis-resources": {"url": "https://www.hr-brew.com/stories/2026/02/17/hr-leaders-ice-minneapolis-resources", "description": "Whereas many CEOs and other corporate executives issued statements within the week following the murder of George Floyd in 2020, the response to violent ICE operations in Minneapolis and beyond has seemed more muted. Many company leaders are more fearful of the current Trump administration than they were during his first term, the Minnesota Star Tribune reported, and have been pressured to dismantle DEI programs they put in place after Floyd’s death five years ago. HR and mental health experts say there are ways for leaders to support workers affected by ICE operations, even if they don’t want to speak on the events publicly.", "snippets": ["HR teams should first acknowledge that the needs of their workers may differ depending on how directly their lives are likely to be affected by ICE, said Jaye Johnson, an Atlanta-based HR and total rewards consultant whose clients include employers in the restaurant and hospitality sectors, said."], "title": "How HR leaders can respond to traumatic events in Minneapolis and beyond", "meta": {"query": "Stories of employees affected by ICE raids in Minneapolis"}, "citation_uuid": -1}, "https://www.threads.com/@ensley74/post/DTVD1lTDfMd/caribou-coffees-has-instructed-their-employees-not-to-refuse-service-to-ice": {"url": "https://www.threads.com/@ensley74/post/DTVD1lTDfMd/caribou-coffees-has-instructed-their-employees-not-to-refuse-service-to-ice", "description": "Caribou Coffees has <strong>instructed their employees not to refuse service to ICE members</strong>. Another reason to support local coffee shops.", "snippets": ["There is a legal difference between public and private areas of businesses, but employees might not realize that. ICE officers need a judge-signed warrant to enter private areas. It’s important for employees to know that. ... Another boycott. I’m glad I have a keurig ... Another reason to make your coffee at home."], "title": "Caribou Coffees has instructed their employees not to refuse service to ICE members. Another reason to support local coffee shops.", "meta": {"query": "Strategies implemented by Caribou Coffee in response to ICE presence"}, "citation_uuid": -1}, "https://blog.osum.com/caribou-coffee-financial-analysis/": {"url": "https://blog.osum.com/caribou-coffee-financial-analysis/", "description": "Changes in consumer preferences, such as shifts towards healthier options or alternative beverages, may also impact Caribou Coffee’s sales. Additionally, external factors such as economic downturns, fluctuations in commodity prices, and changes in regulations can pose threats to the company’s financial performance.", "snippets": ["Changes in consumer preferences, such as shifts towards healthier options or alternative beverages, may also impact Caribou Coffee’s sales. Additionally, external factors such as economic downturns, fluctuations in commodity prices, and changes in regulations can pose threats to the company’s financial performance."], "title": "A Detailed Caribou Coffee Financial Analysis - Osum", "meta": {"query": "Caribou Coffee financial impact from ICE presence"}, "citation_uuid": -1}, "https://www.startribune.com/minneapolis-foundation-small-business-grant-immigration-ice-ceo-letter/601571704": {"url": "https://www.startribune.com/minneapolis-foundation-small-business-grant-immigration-ice-ceo-letter/601571704", "description": "<strong>The nonprofit Minneapolis Foundation</strong> will distribute money to help local businesses make payroll, pay rent and cover other costs. Companies like Target, General Mills and Ecolab contributed.", "snippets": ["“Small businesses and their employees are facing enormous disruptions right now, and these Minnesotans make essential contributions to our regional economy,” R.T. Rybak, president and CEO of the Minneapolis Foundation, said in a statement. “This fund is a great start for the business community to help mobilize resources to support the lives and livelihoods of our neighbors.” · “When I wasn’t brave enough to go out and protest against ICE, they (Alex Pretti and Renee Good) were,” said Veronica Maldonado as she and Jose Powley put a memorial alter together in their honor in Plaza Mexico in Minneapolis on Jan."], "title": "Minnesota companies fund $3.5M in grants to help small businesses during ICE surge", "meta": {"query": "Resources for businesses impacted by ICE in Minneapolis"}, "citation_uuid": -1}, "https://www.reuters.com/business/retail-consumer/small-minneapolis-businesses-hit-hard-by-ice-crackdown-while-corporations-stay-2026-01-16/": {"url": "https://www.reuters.com/business/retail-consumer/small-minneapolis-businesses-hit-hard-by-ice-crackdown-while-corporations-stay-2026-01-16/", "description": "&quot;We don’t know how much longer ... economy is feeling the effects, from <strong>sales declines at small businesses to falling attendance at large companies and agricultural operations</strong>....", "snippets": ["Business associations say the $350 billion regional economy is feeling the effects, from sales declines at small businesses to falling attendance at large companies and agricultural operations. “There are impacts that roll up to Fortune 500 companies and all the way down to sole proprietors,” said Mike Logan, CEO of the Minneapolis Regional Chamber of Commerce.", "“There are impacts that roll up to Fortune 500 companies and all the way down to sole proprietors,” said Mike Logan, CEO of the Minneapolis Regional Chamber of Commerce. The Trump administration has defended the operations, and has added more agents even as 69% of Americans in a recent Reuters poll say federal agents should minimize the harm to people during operations, even if arrests decline. One high-profile ICE incident took place at a Target store in the suburb of Richfield, where a pair of workers - both U.S.", "By contrast, large corporations in Minneapolis have been much less vocal about the effects of immigration enforcement on the city, known as both a bastion of progressive politics in the U.S. Midwest and a robust corporate employer."], "title": "Small Minneapolis businesses hit hard by ICE crackdown, while corporations stay silent | Reuters", "meta": {"query": "Effects of ICE raids on businesses in Minneapolis"}, "citation_uuid": -1}, "https://www.nytimes.com/2026/01/23/us/minnesota-businesses-protest-ice.html": {"url": "https://www.nytimes.com/2026/01/23/us/minnesota-businesses-protest-ice.html", "description": "Thousands of protesters shut down streets throughout Minneapolis-St. Paul to demand that federal immigration agents end their weekslong crackdown. <strong>Businesses closed in solidarity</strong>.", "snippets": ["The action on Friday, which unfolded in subzero temperatures, was the most widespread and organized demonstration since federal agents arrived in Minneapolis more than six weeks ago. It was aimed at pressuring the federal government to pull thousands of its agents from the streets. Businesses, many of them locally owned, closed their doors to halt economic activity, saying that losing a day’s revenue was worth the cost to be part of the effort to end the immigration enforcement."], "title": "Hundreds of Minnesota Businesses on Strike in Protest Against ICE - The New York Times", "meta": {"query": "Effects of ICE raids on businesses in Minneapolis"}, "citation_uuid": -1}, "https://pitchbook.com/profiles/company/12887-11": {"url": "https://pitchbook.com/profiles/company/12887-11", "description": "Information on valuation, funding, acquisitions, investors, and executives for Caribou Coffee. Use the PitchBook Platform to explore the full profile.", "snippets": ["To explore Caribou Coffee‘s full profile, request access. Request a free trial ... Operator of gourmet coffeehouses based in Minneapolis, Minnesota. The company offers handcrafted classics, signature and ... PitchBook’s comparison feature gives you a side-by-side look at key metrics for similar companies. Personalize which data points you want to see and create visualizations instantly."], "title": "Caribou Coffee 2026 Company Profile: Valuation, Funding & Investors | PitchBook", "meta": {"query": "Sales revenue data for Caribou Coffee in Minneapolis"}, "citation_uuid": -1}, "https://www.fox9.com/news/ice-surge-hits-twin-cities-businesses-revenue-loss-reported-jan-2026": {"url": "https://www.fox9.com/news/ice-surge-hits-twin-cities-businesses-revenue-loss-reported-jan-2026", "description": "Following an increase in federal immigration officers throughout the city, <strong>many Latin businesses in northeast Minneapolis closed on Monday due to the presence of ICE agents, with business owners reporting a significant loss in revenue</strong>.", "snippets": ["ICE operations are impacting small businesses in the Twin Cities. Many Hispanic-owned shops are losing significant revenue. Business owners are expressing concerns over financial struggles and community support. MINNEAPOLIS (FOX 9) - The ICE surge is turning vibrant shopping areas into ghost towns, particularly affecting Hispanic-owned businesses in Minneapolis and St."], "title": "ICE surge hits Twin Cities businesses, 50-80% revenue loss reported | FOX 9 Minneapolis-St. Paul", "meta": {"query": "Impact of ICE presence on local businesses in Minneapolis, MN"}, "citation_uuid": -1}, "https://mspmag.com/shop-and-style/mn-retailers-respond-ice-raids-mutual-aid-fundraising-economic-blackout/": {"url": "https://mspmag.com/shop-and-style/mn-retailers-respond-ice-raids-mutual-aid-fundraising-economic-blackout/", "description": "In the wake of the recent surge in ICE raids across the Twin Cities and the killing of Renée Good, <strong>many local businesses are stepping into roles that extend beyond commerce—becoming hubs for mutual aid, fundraising, and community connection</strong> ...", "snippets": ["In the wake of the recent surge in ICE raids across the Twin Cities and the killing of Renée Good, many local businesses are stepping into roles that extend beyond commerce—becoming hubs for mutual aid, fundraising, and community connection during a moment marked by fear and grief.", "Due to the overwhelming, positive response ($7,000 was raised for legal organizations and local mutual aid projects), Lim and Bench Pressed owners Jane and Andy Shannon are teaming up for another all-day pop-up on Saturday, January 24 to sell screen-printed posters, lawn signs, patches, postcards, and more. Alongside donation efforts, some businesses are also participating in the economic blackout scheduled for Friday, January 23—a statewide protest called “ICE Out of Minnesota: Day of Truth and Freedom,” closing their doors in solidarity with a broader movement calling for “no work, no school, no shopping” as a protest against ICE operations.", "The way businesses are responding is mirrored by choices made by the community. As consumers, we make statements with how and where we spend our dollars and time. Donating money and goods, sharing a meal (or getting takeout) at an immigrant-owned restaurant, or shopping at a neighborhood boutique. Across Minneapolis and surrounding areas, shop owners say the past weeks have been emotionally overwhelming, but they’ve found ways to respond.", "The way businesses are responding is mirrored by choices made by the community. As consumers, we make statements with how and where we spend our dollars and time. Donating money and goods, sharing a meal (or getting takeout) at an immigrant-owned restaurant, or shopping at a neighborhood boutique. Across Minneapolis and surrounding areas, shop owners say the past weeks have been emotionally overwhelming, but they’ve found ways to respond. Our local retailers are navigating this moment in real time, balancing survival with solidarity and the belief that small actions can make a big difference."], "title": "Minnesota Retailers Respond to ICE Raids with Mutual Aid, Fundraising, and Economic Blackout - Mpls.St.Paul Magazine", "meta": {"query": "ICE raids impact on local businesses in Minneapolis"}, "citation_uuid": -1}, "https://www.sec.gov/Archives/edgar/data/1332602/000095014406002979/g00301e10vk.htm": {"url": "https://www.sec.gov/Archives/edgar/data/1332602/000095014406002979/g00301e10vk.htm", "description": "In January 2006, we entered into long-term licensing agreements with Kemps Inc., a St. Paul-based dairy, and General Mills Inc., a global food manufacturer. The licensing agreement with Kemps allows Kemps to use Caribou Coffee marks and coffee in producing various gourmet coffee flavored ice cream products.", "snippets": ["We employ marketing strategies to increase brand awareness, encourage trial and repeat purchases by educating potential customers about the distinctive qualities of the Caribou Coffee brand and promote repeat business by reinforcing positive experiences with our products."], "title": "CARIBOU COFFEE COMPANY, INC.", "meta": {"query": "Strategies implemented by Caribou Coffee in response to ICE presence"}, "citation_uuid": -1}, "https://www.twincities.com/2026/02/04/heres-how-to-support-small-businesses-in-twin-cities-impacted-by-ice-surge/": {"url": "https://www.twincities.com/2026/02/04/heres-how-to-support-small-businesses-in-twin-cities-impacted-by-ice-surge/", "description": "<strong>Some 40% of business owners said they would still be viable if they could count on outside support such as grants and donations</strong>. About a fourth said they were only viable after downsizing their staff, and 9% were considering “exit strategies,” ...", "snippets": ["Some 40% of business owners said they would still be viable if they could count on outside support such as grants and donations. About a fourth said they were only viable after downsizing their staff, and 9% were considering “exit strategies,” or closing for good. Alarmed by those and similar findings, the St. Paul Area Chamber of Commerce, Minneapolis Regional Chamber and a dozen additional Twin Cities-area economic development organizations have assembled an online listing of initiatives collecting donations to support small businesses during Operation Metro Surge."], "title": "Here’s how to support small businesses in Twin Cities impacted by ICE surge", "meta": {"query": "Local businesses response to ICE in Minneapolis"}, "citation_uuid": -1}, "https://spokesman-recorder.com/2026/01/23/ice-activity-impacts-local-businesses/": {"url": "https://spokesman-recorder.com/2026/01/23/ice-activity-impacts-local-businesses/", "description": "“When ICE activity increases, people worry about their rights and the safety of their families, and that can <strong>reduce their participation in daily activities, including patronizing local businesses</strong>.”", "snippets": ["Legal advocates confirm the economic ripple effects. Milo Mumgaard, executive director of Mid-Minnesota Legal Aid, said the surge in enforcement has created both operational challenges for legal service providers and economic anxiety for communities. “We see it both from the impacts on immigrant communities and on low-income and vulnerable populations more broadly,” Mumgaard said. “When ICE activity increases, people worry about their rights and the safety of their families, and that can reduce their participation in daily activities, including patronizing local businesses.”", "As the state, especially in diverse cities like Minneapolis, navigates this tense period, local businesses and organizations continue to balance safety, advocacy, and service provision — working to ensure that the economic pulse of immigrant and vulnerable communities does not falter under the weight of fear."], "title": "ICE Activity Impacts Local Businesses Across Minneapolis", "meta": {"query": "Effects of ICE raids on businesses in Minneapolis"}, "citation_uuid": -1}, "https://minnesotanonprofits.org/community-resources-ice-operations": {"url": "https://minnesotanonprofits.org/community-resources-ice-operations", "description": "<strong>Unidos MN / Monarca</strong> is operating the primary hotline for people to report ICE presence in the Twin Cities, as well as providing key resources for immigrants and community defenders.", "snippets": ["Resources to help organizations protect their communities, staff, and operations. ... Preparing for Immigration Enforcement: what businesses should do, and avoid, if ICE shows up (Lathrop GPM)."], "title": "Resources: supporting community during ICE operations - Minnesota ...", "meta": {"query": "Community response to ICE presence in Minneapolis"}, "citation_uuid": -1}, "https://minnesotanonprofits.org/ice-resources": {"url": "https://minnesotanonprofits.org/ice-resources", "description": "Visit <strong>immigrant-owned restaurants and businesses</strong>, which need our support as many have had to limit hours and access due to ICE activity.", "snippets": ["Report incidents involving federal agents to the Attorney General, including violations of constitutional rights, business closures, reduced access to healthcare, school, or child care, etc.", "Money is most needed in this moment. Direct your generosity to local nonprofits, mutual aid groups, and immigrant owned restaurants and businesses.", "Money is most needed in this moment. Direct your generosity to local nonprofits, mutual aid groups, and immigrant owned restaurants and businesses. Visit immigrant-owned restaurants and businesses, which need our support as many have had to limit hours and access due to ICE activity."], "title": "Resources: supporting community during ICE operations - Minnesota Council of Nonprofits", "meta": {"query": "Examples of businesses in Minneapolis affected by ICE presence"}, "citation_uuid": -1}, "https://mncdficoalition.org/ice-response/": {"url": "https://mncdficoalition.org/ice-response/", "description": "<strong>Minneapolis businesses lose $100M in sales</strong> as federal immigration raids shake economy – 2/10/2026 – Minneapolis / St. Paul Business Journal · ‘These are people’s livelihoods’: Minnesota’s economy in crisis amid ICE surge – The Guardian – 2/10/2026 · ‘Survival mode’: Campaign ...", "snippets": ["Community Aid Network MN – Mutual support contributions and distribution based in Minneapolis · Stand With Minnesota – Causes to donate to in Minnesota to help our communities defend themselves from ICE · Minneapolis Mutual Aid Linktree – Mutual aid, food distribution, and other resources · The current actions and attacks on immigrant communities are anti-business, anti-Main Street, and anti-growth."], "title": "Resources for ICE Response - MN CDFI Coalition", "meta": {"query": "Impact of ICE presence on local businesses in Minneapolis, MN"}, "citation_uuid": -1}, "https://www.reddit.com/r/TwinCities/comments/1q8fwdf/caribou_coffee_panera_bread_ice/": {"url": "https://www.reddit.com/r/TwinCities/comments/1q8fwdf/caribou_coffee_panera_bread_ice/", "description": "There was a post with the Caribou&#x27;s corporate guidelines released for ICE encounters - <strong>they won&#x27;t refuse service to anyone, but they won&#x27;t allow ICE access to any non-public areas without a valid warrant</strong>.", "snippets": ["Minneapolis Ice OUT!"], "title": "r/TwinCities on Reddit: Caribou Coffee, Panera Bread ❤️ ICE", "meta": {"query": "Strategies implemented by Caribou Coffee in response to ICE presence"}, "citation_uuid": -1}, "https://en.wikipedia.org/wiki/Operation_Metro_Surge": {"url": "https://en.wikipedia.org/wiki/Operation_Metro_Surge", "description": "In a McDonald&#x27;s in Minneapolis&#x27;s north side, a security guard blocked ICE from forcing their way behind the restaurant&#x27;s counter without a warrant. A video showed ICE agents raiding a Target store and arresting two workers in the Minneapolis suburb of Richfield.", "snippets": ["Citizens report ICE presence and arrests in Columbia Heights and downtown Minneapolis. ICE presence reported in Burnsville, Shakopee, and St.", "Their accounts of the shooting were contested by eyewitnesses, journalists, and Democratic Party lawmakers, some of whom called for criminal proceedings against Ross. The president and federal officials were criticized for espousing conclusions before any investigation had occurred. Minneapolis mayor Jacob Frey and Minnesota governor Tim Walz called on ICE to end their presence in the city."], "title": "Operation Metro Surge - Wikipedia", "meta": {"query": "Effects of ICE raids on businesses in Minneapolis"}, "citation_uuid": -1}, "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-tuesday-feb-10": {"url": "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-tuesday-feb-10", "description": "ICE and Homeland Security officials are testifying before Congress today, and ICE director Todd Lyons is being put on the spot about some of the comments made by ICE agents in the Twin Cities, including Jonathan Ross calling Renee Good a &quot;f****** b****&quot; after shooting her, and the officer who was recorded saying: &quot;If you raise your voice, I&#x27;ll erase your voice.&quot; During a news conference on the impact to Minnesota businesses, Gov. Tim Walz said his expectation is that Operation Metro Surge will end in “days, not weeks and months,” though business owners believe it will take months for the local economy to recover afterward.", "snippets": ["We're following Tuesday's latest developments from the Trump administration's immigration enforcement operation in Minnesota.", "According to citizen reports on the People Over Papers website, ICE has been very active in Brooklyn Park this morning. ... On Monday evening a press alert was issued from the Office of Gov. Tim Walz who is holding a press conference at 11 a.m. on Tuesday to discuss the impact of Operation Metro Surge on Minnesota's small businesses."], "title": "List of ICE raids, major updates in Minnesota on Tuesday, Feb. 10 - Bring Me The News", "meta": {"query": "ICE raids impact on local businesses in Minneapolis"}, "citation_uuid": -1}, "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-thursday-feb-5": {"url": "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-thursday-feb-5", "description": "The latest issue of TIME features a cover story on ICE activity in Minneapolis, titled &quot;The Siege of an American City,&quot; which includes an interview with Mayor Jacob Frey. &quot;There’s a very straightforward antidote, and that is to leave,&quot; Frey told the magazine. &quot;They leave, those businesses have customers again.", "snippets": ["The latest issue of TIME features a cover story on ICE activity in Minneapolis, titled \"The Siege of an American City,\" which includes an interview with Mayor Jacob Frey. \"There’s a very straightforward antidote, and that is to leave,\" Frey told the magazine. \"They leave, those businesses have customers again.", "Bring Me The News continues to follow the latest developments of Operation Metro Surge, including ICE raids and the impact on communities, businesses, schools, and other facets of life across Minnesota."], "title": "List of ICE raids, major updates in Minnesota on Thursday, Feb. 5 - Bring Me The News", "meta": {"query": "Effects of ICE raids on businesses in Minneapolis"}, "citation_uuid": -1}, "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-monday-feb-2": {"url": "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-monday-feb-2", "description": "Today marks the first official work day for new Target CEO Michael Fiddelke, and it starts with a protest outside headquarters in downtown Minneapolis. Target has been criticized for not speaking out against ICE operations into its home state, which has included employees being arrested and federal agents operating inside stores.", "snippets": ["Here's a look at where things stand as of 11 a.m. Monday, with unverified reports of arrests by ICE in downtown Minneapolis, north Minneapolis, and Falcon Heights, and reports of activity in cities including Columbia Heights, Burnsville, Shakopee, and St."], "title": "List of ICE raids, major updates in Minnesota on Monday, Feb. 2 - Bring Me The News", "meta": {"query": "Stories of employees affected by ICE raids in Minneapolis"}, "citation_uuid": -1}, "https://newrepublic.com/article/205446/minneapolis-faith-leaders-response-ice": {"url": "https://newrepublic.com/article/205446/minneapolis-faith-leaders-response-ice", "description": "Sherman-Conroy said that Movement Chaplains only go where they are invited, wearing orange shirts to identify their presence. “When we go into these spaces, we don’t center ourselves, right? We center our community. So for us, the idea is that community is a spiritual practice,” she said. There has been some tension in Minneapolis faith communities in recent days. On Sunday, protesters disrupted a worship service at a St. Paul church, where one of the pastors serves as the head of the local ICE field office.", "snippets": ["Sherman-Conroy said that Movement Chaplains only go where they are invited, wearing orange shirts to identify their presence. “When we go into these spaces, we don’t center ourselves, right? We center our community. So for us, the idea is that community is a spiritual practice,” she said. There has been some tension in Minneapolis faith communities in recent days. On Sunday, protesters disrupted a worship service at a St. Paul church, where one of the pastors serves as the head of the local ICE field office."], "title": "The Minneapolis Faith Community Is Showing How to Fight ICE | The New Republic", "meta": {"query": "Community response to ICE presence in Minneapolis"}, "citation_uuid": -1}, "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-tuesday-feb-17": {"url": "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-tuesday-feb-17", "description": "Reps. Lisa Demuth and Harry Niska accused Democrats of hurting small businesses rather than federal agents. ... Càphin is celebrating two years with the opening of a second location. ... Minneapolis and St.", "snippets": ["The Minneapolis City Council Committee of the Whole is meeting at 9:30 a.m., and there is an effort among activists groups to encourage attendance to show support for a council resolution demanding congressional action into the conduct of federal immigration officers during Operation Metro Surge."], "title": "List of ICE raids, major updates in Minnesota on Tuesday, Feb. 17 - Bring Me The News", "meta": {"query": "Specific incidents of ICE actions affecting businesses in Minneapolis, MN"}, "citation_uuid": -1}, "https://finance-commerce.com/2026/01/minneapolis-businesses-silent-ice-raids/": {"url": "https://finance-commerce.com/2026/01/minneapolis-businesses-silent-ice-raids/", "description": "Business associations say the $350 billion regional economy is feeling the effects, from <strong>sales declines at small businesses to falling attendance at large companies and agricultural operations</strong>.", "snippets": ["Business associations say the $350 billion regional economy is feeling the effects, from sales declines at small businesses to falling attendance at large companies and agricultural operations. “There are impacts that roll up to Fortune 500 companies and all the way down to sole proprietors,” said Mike Logan, CEO of the Minneapolis Regional Chamber of Commerce."], "title": "ICE raids spark fear in small businesses, while corporations stay silent", "meta": {"query": "Effects of ICE raids on businesses in Minneapolis"}, "citation_uuid": -1}, "https://kstp.com/kstp-news/top-news/ice-presence-chills-business-cancels-events-in-twin-cities/": {"url": "https://kstp.com/kstp-news/top-news/ice-presence-chills-business-cancels-events-in-twin-cities/", "description": "“Commerce and business doesn’t do well when there’s uncertainty,” said Adam Duininck, president and CEO of the Minneapolis Downtown Council. Duininck said restaurants are hit hardest, with closures not seen since 2020. They are still counting the temporary closures, which are definitely in the dozens. “I think it’s an uncertainty about whether customers are going to be out. I think that there’s a safety concern from the employees,” Duininck said. RELATED: Hundreds protest ICE in downtown Minneapolis; at least 29 people detained", "snippets": ["“The impacts right now are significant… And unless something changes, we’ll be dealing with these challenges,” Duininck said. Duininck said that as long as federal operations continue at this level, economic uncertainty will likely persist, potentially setting back business growth and recovery since 2020."], "title": "ICE presence chills business, cancels events in Twin Cities - KSTP.com 5 Eyewitness News", "meta": {"query": "Impact of ICE presence in Minneapolis on local businesses"}, "citation_uuid": -1}}}