{"url_to_unified_index": {"https://www.startribune.com/minneapolis-foundation-small-business-grant-immigration-ice-ceo-letter/601571704": 3, "https://www.reuters.com/business/retail-consumer/small-minneapolis-businesses-hit-hard-by-ice-crackdown-while-corporations-stay-2026-01-16/": 1, "https://www.nytimes.com/2026/01/23/us/minnesota-businesses-protest-ice.html": 2, "https://www.reddit.com/r/TwinCities/comments/1q8fwdf/caribou_coffee_panera_bread_ice/": 4, "https://en.wikipedia.org/wiki/Operation_Metro_Surge": 5, "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-tuesday-feb-10": 8, "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-thursday-feb-5": 7, "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-monday-feb-2": 6, "https://www.terrafirmamagazine.com/case-studies/caribou-coffee/": 11, "https://kstp.com/kstp-news/top-news/ice-presence-chills-business-cancels-events-in-twin-cities/": 12, "https://www.sec.gov/Archives/edgar/data/1332602/000095014405009927/g96252b4e424b4.htm": 13, "https://www.bbc.com/news/articles/c4g4y4gwjpeo": 9, "https://www.hr-brew.com/stories/2026/02/17/hr-leaders-ice-minneapolis-resources": 14, "https://mspmag.com/shop-and-style/mn-retailers-respond-ice-raids-mutual-aid-fundraising-economic-blackout/": 10, "https://www.academia.edu/6803298/Caribou_Coffee_Survival_of_the_Runner": 15, "https://www.fox9.com/news/ice-surge-hits-twin-cities-businesses-revenue-loss-reported-jan-2026": 29, "https://www.fox9.com/news/how-help-minneapolis-community-during-ice-surge": 30, "https://www.sec.gov/Archives/edgar/data/1332602/000095014406002979/g00301e10vk.htm": 31, "https://spokesman-recorder.com/2026/01/23/ice-activity-impacts-local-businesses/": 16, "https://spokesman-recorder.com/2026/02/10/black-business-impact/": 17, "https://kstp.com/kstp-news/top-news/how-minneapolis-is-tallying-the-cost-of-ice-report-says-small-businesses-lost-up-to-81m-in-january/": 18, "https://www.marketplace.org/story/2026/01/26/minnesota-ice-raids-strain-small-businesses": 19, "https://www.startribune.com/ice-economic-impact-minneapolis-small-business-immigrant-owned-revenue-loss-financial/601576602": 20, "https://www.latimes.com/business/story/2026-01-27/minnesotas-fortune-500-companies-speak-out-on-ice-not-loudly-enough": 27, "https://newrepublic.com/article/205446/minneapolis-faith-leaders-response-ice": 28, "https://www.bonappetit.com/story/amid-ice-raids-running-a-minneapolis-restaurant-is-an-act-of-resistance": 21, "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-wednesday-feb-18": 24, "https://www.mprnews.org/live-updates": 23, "https://www.twincities.com/2026/02/04/heres-how-to-support-small-businesses-in-twin-cities-impacted-by-ice-surge/": 22, "https://minnesotanonprofits.org/ice-resources": 25, "https://www.aclu.org/press-releases/new-filings-detail-harrowing-accounts-of-ice-and-border-patrol-violence-and-intimidation-against-minnesotans": 26}, "url_to_info": {"https://www.startribune.com/minneapolis-foundation-small-business-grant-immigration-ice-ceo-letter/601571704": {"url": "https://www.startribune.com/minneapolis-foundation-small-business-grant-immigration-ice-ceo-letter/601571704", "description": "<strong>The nonprofit Minneapolis Foundation</strong> will distribute money to help local businesses make payroll, pay rent and cover other costs. Companies like Target, General Mills and Ecolab contributed.", "snippets": ["“Small businesses and their employees are facing enormous disruptions right now, and these Minnesotans make essential contributions to our regional economy,” R.T. Rybak, president and CEO of the Minneapolis Foundation, said in a statement. “This fund is a great start for the business community to help mobilize resources to support the lives and livelihoods of our neighbors.” · “When I wasn’t brave enough to go out and protest against ICE, they (Alex Pretti and Renee Good) were,” said Veronica Maldonado as she and Jose Powley put a memorial alter together in their honor in Plaza Mexico in Minneapolis on Jan."], "title": "Minnesota companies fund $3.5M in grants to help small businesses during ICE surge", "meta": {"query": "Resources for businesses impacted by ICE in Minneapolis"}, "citation_uuid": -1}, "https://www.reuters.com/business/retail-consumer/small-minneapolis-businesses-hit-hard-by-ice-crackdown-while-corporations-stay-2026-01-16/": {"url": "https://www.reuters.com/business/retail-consumer/small-minneapolis-businesses-hit-hard-by-ice-crackdown-while-corporations-stay-2026-01-16/", "description": "&quot;We don’t know how much longer ... economy is feeling the effects, from <strong>sales declines at small businesses to falling attendance at large companies and agricultural operations</strong>....", "snippets": ["“There are impacts that roll up to Fortune 500 companies and all the way down to sole proprietors,” said Mike Logan, CEO of the Minneapolis Regional Chamber of Commerce. The Trump administration has defended the operations, and has added more agents even as 69% of Americans in a recent Reuters poll say federal agents should minimize the harm to people during operations, even if arrests decline. One high-profile ICE incident took place at a Target store in the suburb of Richfield, where a pair of workers - both U.S."], "title": "Small Minneapolis businesses hit hard by ICE crackdown, while corporations stay silent | Reuters", "meta": {"query": "Effects of ICE raids on businesses in Minneapolis"}, "citation_uuid": -1}, "https://www.nytimes.com/2026/01/23/us/minnesota-businesses-protest-ice.html": {"url": "https://www.nytimes.com/2026/01/23/us/minnesota-businesses-protest-ice.html", "description": "Thousands of protesters shut down streets throughout Minneapolis-St. Paul to demand that federal immigration agents end their weekslong crackdown. <strong>Businesses closed in solidarity</strong>.", "snippets": ["The action on Friday, which unfolded in subzero temperatures, was the most widespread and organized demonstration since federal agents arrived in Minneapolis more than six weeks ago. It was aimed at pressuring the federal government to pull thousands of its agents from the streets. Businesses, many of them locally owned, closed their doors to halt economic activity, saying that losing a day’s revenue was worth the cost to be part of the effort to end the immigration enforcement."], "title": "Hundreds of Minnesota Businesses on Strike in Protest Against ICE - The New York Times", "meta": {"query": "Effects of ICE raids on businesses in Minneapolis"}, "citation_uuid": -1}, "https://www.reddit.com/r/TwinCities/comments/1q8fwdf/caribou_coffee_panera_bread_ice/": {"url": "https://www.reddit.com/r/TwinCities/comments/1q8fwdf/caribou_coffee_panera_bread_ice/", "description": "There was a post with the Caribou&#x27;s corporate guidelines released for ICE encounters - <strong>they won&#x27;t refuse service to anyone, but they won&#x27;t allow ICE access to any non-public areas without a valid warrant</strong>.", "snippets": ["Minneapolis Ice OUT!"], "title": "r/TwinCities on Reddit: Caribou Coffee, Panera Bread ❤️ ICE", "meta": {"query": "Strategies implemented by Caribou Coffee in response to ICE presence"}, "citation_uuid": -1}, "https://en.wikipedia.org/wiki/Operation_Metro_Surge": {"url": "https://en.wikipedia.org/wiki/Operation_Metro_Surge", "description": "In a McDonald&#x27;s in Minneapolis&#x27;s north side, a security guard blocked ICE from forcing their way behind the restaurant&#x27;s counter without a warrant. A video showed ICE agents raiding a Target store and arresting two workers in the Minneapolis suburb of Richfield.", "snippets": ["Citizens report ICE presence and arrests in Columbia Heights and downtown Minneapolis. ICE presence reported in Burnsville, Shakopee, and St.", "Their accounts of the shooting were contested by eyewitnesses, journalists, and Democratic Party lawmakers, some of whom called for criminal proceedings against Ross. The president and federal officials were criticized for espousing conclusions before any investigation had occurred. Minneapolis mayor Jacob Frey and Minnesota governor Tim Walz called on ICE to end their presence in the city."], "title": "Operation Metro Surge - Wikipedia", "meta": {"query": "Effects of ICE raids on businesses in Minneapolis"}, "citation_uuid": -1}, "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-tuesday-feb-10": {"url": "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-tuesday-feb-10", "description": "ICE and Homeland Security officials are testifying before Congress today, and ICE director Todd Lyons is being put on the spot about some of the comments made by ICE agents in the Twin Cities, including Jonathan Ross calling Renee Good a &quot;f****** b****&quot; after shooting her, and the officer who was recorded saying: &quot;If you raise your voice, I&#x27;ll erase your voice.&quot; During a news conference on the impact to Minnesota businesses, Gov. Tim Walz said his expectation is that Operation Metro Surge will end in “days, not weeks and months,” though business owners believe it will take months for the local economy to recover afterward.", "snippets": ["We're following Tuesday's latest developments from the Trump administration's immigration enforcement operation in Minnesota.", "According to citizen reports on the People Over Papers website, ICE has been very active in Brooklyn Park this morning. ... On Monday evening a press alert was issued from the Office of Gov. Tim Walz who is holding a press conference at 11 a.m. on Tuesday to discuss the impact of Operation Metro Surge on Minnesota's small businesses."], "title": "List of ICE raids, major updates in Minnesota on Tuesday, Feb. 10 - Bring Me The News", "meta": {"query": "ICE raids impact on local businesses in Minneapolis"}, "citation_uuid": -1}, "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-thursday-feb-5": {"url": "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-thursday-feb-5", "description": "The latest issue of TIME features a cover story on ICE activity in Minneapolis, titled &quot;The Siege of an American City,&quot; which includes an interview with Mayor Jacob Frey. &quot;There’s a very straightforward antidote, and that is to leave,&quot; Frey told the magazine. &quot;They leave, those businesses have customers again.", "snippets": ["The latest issue of TIME features a cover story on ICE activity in Minneapolis, titled \"The Siege of an American City,\" which includes an interview with Mayor Jacob Frey. \"There’s a very straightforward antidote, and that is to leave,\" Frey told the magazine. \"They leave, those businesses have customers again.", "Bring Me The News continues to follow the latest developments of Operation Metro Surge, including ICE raids and the impact on communities, businesses, schools, and other facets of life across Minnesota."], "title": "List of ICE raids, major updates in Minnesota on Thursday, Feb. 5 - Bring Me The News", "meta": {"query": "Effects of ICE raids on businesses in Minneapolis"}, "citation_uuid": -1}, "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-monday-feb-2": {"url": "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-monday-feb-2", "description": "Today marks the first official work day for new Target CEO Michael Fiddelke, and it starts with a protest outside headquarters in downtown Minneapolis. Target has been criticized for not speaking out against ICE operations into its home state, which has included employees being arrested and federal agents operating inside stores.", "snippets": ["Here's a look at where things stand as of 11 a.m. Monday, with unverified reports of arrests by ICE in downtown Minneapolis, north Minneapolis, and Falcon Heights, and reports of activity in cities including Columbia Heights, Burnsville, Shakopee, and St."], "title": "List of ICE raids, major updates in Minnesota on Monday, Feb. 2 - Bring Me The News", "meta": {"query": "Stories of employees affected by ICE raids in Minneapolis"}, "citation_uuid": -1}, "https://www.terrafirmamagazine.com/case-studies/caribou-coffee/": {"url": "https://www.terrafirmamagazine.com/case-studies/caribou-coffee/", "description": "“We’re always pushing the envelope here at Caribou Coffee; we want to evolve our tea, caramel and sandwich lines,” reveals Tattersfield when asked about the company’s philosophy toward upgrading its product platforms. “We want to offer tastes appealing to the younger generation and deliver a high-quality food product in a high-experience environment.” · At the core of operations is a dedication to providing a community place that is fun, passionate, authentic, fair, accepting, responsible, and deeply involved in listening, recognizing and developing innovative, quality items that connect with guests and the company team.", "snippets": ["“We’re always pushing the envelope here at Caribou Coffee; we want to evolve our tea, caramel and sandwich lines,” reveals Tattersfield when asked about the company’s philosophy toward upgrading its product platforms. “We want to offer tastes appealing to the younger generation and deliver a high-quality food product in a high-experience environment.” · At the core of operations is a dedication to providing a community place that is fun, passionate, authentic, fair, accepting, responsible, and deeply involved in listening, recognizing and developing innovative, quality items that connect with guests and the company team.", "Caribou Coffee is dedicated to having a positive impact on more than just taste buds."], "title": "Caribou Coffee - Terra Firma", "meta": {"query": "Impact of ICE on Caribou Coffee operations"}, "citation_uuid": -1}, "https://kstp.com/kstp-news/top-news/ice-presence-chills-business-cancels-events-in-twin-cities/": {"url": "https://kstp.com/kstp-news/top-news/ice-presence-chills-business-cancels-events-in-twin-cities/", "description": "“Commerce and business doesn’t do well when there’s uncertainty,” said Adam Duininck, president and CEO of the Minneapolis Downtown Council. Duininck said restaurants are hit hardest, with closures not seen since 2020. They are still counting the temporary closures, which are definitely in the dozens. “I think it’s an uncertainty about whether customers are going to be out. I think that there’s a safety concern from the employees,” Duininck said. RELATED: Hundreds protest ICE in downtown Minneapolis; at least 29 people detained", "snippets": ["“The impacts right now are significant… And unless something changes, we’ll be dealing with these challenges,” Duininck said. Duininck said that as long as federal operations continue at this level, economic uncertainty will likely persist, potentially setting back business growth and recovery since 2020."], "title": "ICE presence chills business, cancels events in Twin Cities - KSTP.com 5 Eyewitness News", "meta": {"query": "ICE presence impact on local businesses in Minneapolis"}, "citation_uuid": -1}, "https://www.sec.gov/Archives/edgar/data/1332602/000095014405009927/g96252b4e424b4.htm": {"url": "https://www.sec.gov/Archives/edgar/data/1332602/000095014405009927/g96252b4e424b4.htm", "description": "As part of our growth strategy, we will continue to seek licensees to operate coffeehouses under the Caribou Coffee brand in international markets and in certain strategic domestic locations or venues. We believe that our ability to recruit, retain and contract with qualified licensees will be increasingly important to our operations as we expand. Our licensees are dependent upon the availability of adequate sources of financing in order to meet their development obligations.", "snippets": ["If we experience an interruption or disruption in these services, we may be unable to ship our coffee in a timely manner. A delay in shipping could: If there is a significant increase in shipping costs, we may face a decrease in revenue and profits. If we bear these costs without an increase in our prices, then our profit margins would go down. If the costs are passed on to the customers in the form of higher prices, then our net sales may suffer if the cost"], "title": "CARIBOU COFFEE COMPANY, INC.", "meta": {"query": "Caribou Coffee financial impact from ICE presence"}, "citation_uuid": -1}, "https://www.bbc.com/news/articles/c4g4y4gwjpeo": {"url": "https://www.bbc.com/news/articles/c4g4y4gwjpeo", "description": "Federal agents shot and killed two US citizens in Minneapolis last month, and migrants with clean records and US citizens have been caught up in the crackdown. Workplaces have emerged as a key battleground, as officers use them to make detentions. Anti-ICE activists have responded with protests aimed at businesses, including Target, Home Depot, DR Horton and the Hilton hotel chain.", "snippets": ["Employees are pushing firms to provide clearer guidance about how to respond if Immigration and Customs Enforcement (ICE) officers arrive at their worksites - and asking them to do more to limit agents' access to stores and parking lots. The pressures have been particularly acute at Target, a national name and one of the state's flagship employers, after the detention of two workers inside one of its suburban Minneapolis stores last month."], "title": "Why Target is under fire over Minnesota ICE raids", "meta": {"query": "Effects of ICE raids on businesses in Minneapolis"}, "citation_uuid": -1}, "https://www.hr-brew.com/stories/2026/02/17/hr-leaders-ice-minneapolis-resources": {"url": "https://www.hr-brew.com/stories/2026/02/17/hr-leaders-ice-minneapolis-resources", "description": "Employers can understand that some ... she continued. Workers should know how to access resources such as <strong>counseling or Employee Assistance Programs</strong> if available to them, she said....", "snippets": ["HR teams should first acknowledge that the needs of their workers may differ depending on how directly their lives are likely to be affected by ICE, said Jaye Johnson, an Atlanta-based HR and total rewards consultant whose clients include employers in the restaurant and hospitality sectors, said."], "title": "How HR leaders can respond to traumatic events in Minneapolis and beyond", "meta": {"query": "Resources for businesses impacted by ICE in Minneapolis"}, "citation_uuid": -1}, "https://mspmag.com/shop-and-style/mn-retailers-respond-ice-raids-mutual-aid-fundraising-economic-blackout/": {"url": "https://mspmag.com/shop-and-style/mn-retailers-respond-ice-raids-mutual-aid-fundraising-economic-blackout/", "description": "At Tandem Vintage in the Kingfield neighborhood of Minneapolis, owner Amanda Baumann organized a diaper drive at the store and pledged 10 percent of sales to the <strong>Community Aid Network of Minnesota</strong>, a grassroots mutual aid organization supporting ...", "snippets": ["In the wake of the recent surge in ICE raids across the Twin Cities and the killing of Renée Good, many local businesses are stepping into roles that extend beyond commerce—becoming hubs for mutual aid, fundraising, and community connection during a moment marked by fear and grief.", "Due to the overwhelming, positive response ($7,000 was raised for legal organizations and local mutual aid projects), Lim and Bench Pressed owners Jane and Andy Shannon are teaming up for another all-day pop-up on Saturday, January 24 to sell screen-printed posters, lawn signs, patches, postcards, and more. Alongside donation efforts, some businesses are also participating in the economic blackout scheduled for Friday, January 23—a statewide protest called “ICE Out of Minnesota: Day of Truth and Freedom,” closing their doors in solidarity with a broader movement calling for “no work, no school, no shopping” as a protest against ICE operations.", "The way businesses are responding is mirrored by choices made by the community. As consumers, we make statements with how and where we spend our dollars and time. Donating money and goods, sharing a meal (or getting takeout) at an immigrant-owned restaurant, or shopping at a neighborhood boutique. Across Minneapolis and surrounding areas, shop owners say the past weeks have been emotionally overwhelming, but they’ve found ways to respond.", "The way businesses are responding is mirrored by choices made by the community. As consumers, we make statements with how and where we spend our dollars and time. Donating money and goods, sharing a meal (or getting takeout) at an immigrant-owned restaurant, or shopping at a neighborhood boutique. Across Minneapolis and surrounding areas, shop owners say the past weeks have been emotionally overwhelming, but they’ve found ways to respond. Our local retailers are navigating this moment in real time, balancing survival with solidarity and the belief that small actions can make a big difference."], "title": "Minnesota Retailers Respond to ICE Raids with Mutual Aid, Fundraising, and Economic Blackout - Mpls.St.Paul Magazine", "meta": {"query": "Resources for businesses impacted by ICE in Minneapolis"}, "citation_uuid": -1}, "https://www.academia.edu/6803298/Caribou_Coffee_Survival_of_the_Runner": {"url": "https://www.academia.edu/6803298/Caribou_Coffee_Survival_of_the_Runner", "description": "Caribou Coffee, once the second-largest coffee shop chain in the USA, faced significant challenges leading to its acquisition by JAB Holding Company and the closure of numerous locations. This paper analyzes the external competitive environment and internal strategies of Caribou, highlighting its approach to customer service, employee engagement, and organizational structure as pathways to regain market strength.", "snippets": ["How did Caribou's store closings affect customer loyalty?add · The closure of 168 locations led to a notable backlash, with employees and loyal customers voicing their discontent through social media protests, indicating strong brand loyalty. What strategies did Caribou employ for customer engagement?add"], "title": "(PDF) Caribou Coffee: Survival of the Runner", "meta": {"query": "Strategies implemented by Caribou Coffee in response to ICE presence"}, "citation_uuid": -1}, "https://www.fox9.com/news/ice-surge-hits-twin-cities-businesses-revenue-loss-reported-jan-2026": {"url": "https://www.fox9.com/news/ice-surge-hits-twin-cities-businesses-revenue-loss-reported-jan-2026", "description": "Following an increase in federal immigration officers throughout the city, <strong>many Latin businesses in northeast Minneapolis closed on Monday due to the presence of ICE agents, with business owners reporting a significant loss in revenue</strong>.", "snippets": ["ICE operations are impacting small businesses in the Twin Cities. Many Hispanic-owned shops are losing significant revenue. Business owners are expressing concerns over financial struggles and community support. MINNEAPOLIS (FOX 9) - The ICE surge is turning vibrant shopping areas into ghost towns, particularly affecting Hispanic-owned businesses in Minneapolis and St."], "title": "ICE surge hits Twin Cities businesses, 50-80% revenue loss reported | FOX 9 Minneapolis-St. Paul", "meta": {"query": "Impact of ICE presence on local businesses in Minneapolis, MN"}, "citation_uuid": -1}, "https://www.fox9.com/news/how-help-minneapolis-community-during-ice-surge": {"url": "https://www.fox9.com/news/how-help-minneapolis-community-during-ice-surge", "description": "Mercado Central is at the heart of south Minneapolis and is owned and operated by immigrants. It is a central business hub for many family and immigrant-owned businesses. During the recent ICE surge, businesses inside have struggled to generate sales and make rent to Mercado Central.", "snippets": ["MINNEAPOLIS (FOX 9) - Minneapolis residents, business owners and community members have been impacted by the recent ICE surge in the city."], "title": "How to help Minneapolis community during ICE surge | FOX 9 Minneapolis-St. Paul", "meta": {"query": "ICE interactions with local businesses in Minneapolis"}, "citation_uuid": -1}, "https://www.sec.gov/Archives/edgar/data/1332602/000095014406002979/g00301e10vk.htm": {"url": "https://www.sec.gov/Archives/edgar/data/1332602/000095014406002979/g00301e10vk.htm", "description": "In January 2006, we entered into long-term licensing agreements with Kemps Inc., a St. Paul-based dairy, and General Mills Inc., a global food manufacturer. The licensing agreement with Kemps allows Kemps to use Caribou Coffee marks and coffee in producing various gourmet coffee flavored ice cream products.", "snippets": ["We employ marketing strategies to increase brand awareness, encourage trial and repeat purchases by educating potential customers about the distinctive qualities of the Caribou Coffee brand and promote repeat business by reinforcing positive experiences with our products."], "title": "CARIBOU COFFEE COMPANY, INC.", "meta": {"query": "Strategies implemented by Caribou Coffee in response to ICE presence"}, "citation_uuid": -1}, "https://spokesman-recorder.com/2026/01/23/ice-activity-impacts-local-businesses/": {"url": "https://spokesman-recorder.com/2026/01/23/ice-activity-impacts-local-businesses/", "description": "“When ICE activity increases, people worry about their rights and the safety of their families, and that can <strong>reduce their participation in daily activities, including patronizing local businesses</strong>.”", "snippets": ["Legal advocates confirm the economic ripple effects. Milo Mumgaard, executive director of Mid-Minnesota Legal Aid, said the surge in enforcement has created both operational challenges for legal service providers and economic anxiety for communities. “We see it both from the impacts on immigrant communities and on low-income and vulnerable populations more broadly,” Mumgaard said. “When ICE activity increases, people worry about their rights and the safety of their families, and that can reduce their participation in daily activities, including patronizing local businesses.”", "As the state, especially in diverse cities like Minneapolis, navigates this tense period, local businesses and organizations continue to balance safety, advocacy, and service provision — working to ensure that the economic pulse of immigrant and vulnerable communities does not falter under the weight of fear."], "title": "ICE Activity Impacts Local Businesses Across Minneapolis", "meta": {"query": "Effects of ICE raids on businesses in Minneapolis"}, "citation_uuid": -1}, "https://spokesman-recorder.com/2026/02/10/black-business-impact/": {"url": "https://spokesman-recorder.com/2026/02/10/black-business-impact/", "description": "Based on City of Minneapolis estimates, <strong>small businesses are losing between $10 million and $20 million each week due to lost sales, closures, and workforce disruptions</strong>, according to Russ Adams.", "snippets": ["Based on City of Minneapolis estimates, small businesses are losing between $10 million and $20 million each week due to lost sales, closures, and workforce disruptions, according to Russ Adams. “On Lake Street specifically, our projections show roughly $46 million in lost revenue across December and January alone,” Adams said. “You don’t come back from that in a single quarter.” · The ripple effects extend beyond individual storefronts."], "title": "Black Business Impact From ICE Crackdown in Minnesota", "meta": {"query": "Effects of ICE raids on businesses in Minneapolis"}, "citation_uuid": -1}, "https://kstp.com/kstp-news/top-news/how-minneapolis-is-tallying-the-cost-of-ice-report-says-small-businesses-lost-up-to-81m-in-january/": {"url": "https://kstp.com/kstp-news/top-news/how-minneapolis-is-tallying-the-cost-of-ice-report-says-small-businesses-lost-up-to-81m-in-january/", "description": "Minneapolis is facing significant ... in January. On Friday, Mayor Jacob Frey said that <strong>small businesses and restaurants in the city lost as much as $81 million in revenue</strong>....", "snippets": ["The report said the city used a similar framework to add up losses for grocery, retail, entertainment, and more, concluding that “January 2026 revenue losses for small, consumer-facing businesses in Minneapolis could be as high as $81 million.”", "Minneapolis is facing significant financial losses due to immigration enforcement operations, with a reported $200 million economic hit in January. On Friday, Mayor Jacob Frey said that small businesses and restaurants in the city lost as much as $81 million in revenue."], "title": "How Minneapolis is tallying the cost of ICE; Report says small businesses lost up to $81M in January - KSTP.com 5 Eyewitness News", "meta": {"query": "Local businesses in Minneapolis affected by ICE"}, "citation_uuid": -1}, "https://www.marketplace.org/story/2026/01/26/minnesota-ice-raids-strain-small-businesses": {"url": "https://www.marketplace.org/story/2026/01/26/minnesota-ice-raids-strain-small-businesses", "description": "Kirsti Marohn: The owners I spoke to say they&#x27;re struggling with two problems. First, <strong>businesses that cater to immigrants are seeing fewer customers</strong>. People are scared to leave their homes and venture out for fear of being stopped and detained ...", "snippets": ["Employees and customers are staying home, business owners are cutting hours, and entire communities are feeling the ripple effects of the ICE crackdown. Immigrationby David Brancaccio and Ashley Rodriguez ... Heightened immigration enforcement is affecting immigrant-owned businesses, workers, and local economies."], "title": "Minnesota ICE raids strain small businesses", "meta": {"query": "Effects of ICE raids on businesses in Minneapolis"}, "citation_uuid": -1}, "https://www.startribune.com/ice-economic-impact-minneapolis-small-business-immigrant-owned-revenue-loss-financial/601576602": {"url": "https://www.startribune.com/ice-economic-impact-minneapolis-small-business-immigrant-owned-revenue-loss-financial/601576602", "description": "<strong>The estimated losses for small, customer-facing businesses citywide is about $15 million</strong>, so CPED settled on a weekly loss figure in the $10 million to $20 million range. That’s likely an understatement, city officials said.", "snippets": ["Immigrant-owned businesses are bearing the brunt of the losses from Operation Metro Surge, but effects are widespread. ... Hundreds of people flood into the Karmel Mall, a business center for the Somali community, to patronize immigrant-owned businesses after an anti-ICE protest on Lake Street in Minneapolis on Dec.", "Immigrant-owned businesses are bearing the brunt of the losses from Operation Metro Surge, but effects are widespread."], "title": "Minneapolis businesses losing millions in sales each week as ICE operation continues", "meta": {"query": "ICE presence impact on local businesses in Minneapolis"}, "citation_uuid": -1}, "https://www.latimes.com/business/story/2026-01-27/minnesotas-fortune-500-companies-speak-out-on-ice-not-loudly-enough": {"url": "https://www.latimes.com/business/story/2026-01-27/minnesotas-fortune-500-companies-speak-out-on-ice-not-loudly-enough", "description": "Plummeting sales at Target show that DEI is a lot more popular than businesses think. May 28, 2025 · What’s infuriating is that for many Americans — including, notably, Minnesota Gov. Tim Walz and Minneapolis Mayor Jacob Frey — the solution to this crisis is crystal clear: Get ICE and the Border Patrol out of Minneapolis neighborhoods.", "snippets": ["The joint statement by 60 Minnesota CEOs represents a significant turning point and achievement in corporate willingness to address federal policies, particularly given historical corporate reluctance to engage in contentious political issues, and the breadth of corporate participation may be sufficient to prompt the administration to reconsider its approach in Minneapolis. Behind-the-scenes engagement by business leaders with state, local, and federal officials, including direct communication with the Governor, the White House, Vice President JD Vance, and local mayors, may prove more effective at achieving practical results than public denunciations that could provoke stronger retaliatory responses from the administration."], "title": "Commentary: Minnesota's Fortune 500 corporations finally speak out about ICE, but not loudly enough", "meta": {"query": "ICE interactions with local businesses in Minneapolis"}, "citation_uuid": -1}, "https://newrepublic.com/article/205446/minneapolis-faith-leaders-response-ice": {"url": "https://newrepublic.com/article/205446/minneapolis-faith-leaders-response-ice", "description": "Sherman-Conroy said that Movement Chaplains only go where they are invited, wearing orange shirts to identify their presence. “When we go into these spaces, we don’t center ourselves, right? We center our community. So for us, the idea is that community is a spiritual practice,” she said. There has been some tension in Minneapolis faith communities in recent days. On Sunday, protesters disrupted a worship service at a St. Paul church, where one of the pastors serves as the head of the local ICE field office.", "snippets": ["Sherman-Conroy said that Movement Chaplains only go where they are invited, wearing orange shirts to identify their presence. “When we go into these spaces, we don’t center ourselves, right? We center our community. So for us, the idea is that community is a spiritual practice,” she said. There has been some tension in Minneapolis faith communities in recent days. On Sunday, protesters disrupted a worship service at a St. Paul church, where one of the pastors serves as the head of the local ICE field office."], "title": "The Minneapolis Faith Community Is Showing How to Fight ICE | The New Republic", "meta": {"query": "Community response to ICE presence in Minneapolis"}, "citation_uuid": -1}, "https://www.bonappetit.com/story/amid-ice-raids-running-a-minneapolis-restaurant-is-an-act-of-resistance": {"url": "https://www.bonappetit.com/story/amid-ice-raids-running-a-minneapolis-restaurant-is-an-act-of-resistance", "description": "When you live in a place where the population is only half a million people—there are 430,000 people in Minneapolis—to have 3,000 federal agents around means they are everywhere. When we think back to all of the years working in restaurants, there’s not a month or a season or part of the year that was as complicated as this one. What restaurants in the city are going through—nobody has an idea of what’s happening. You might not have employees one day showing up to work. It’s very complicated to run a business right now. ICE Raided Chicago’s Immigrant Communities, but These Neighbors United to Save Local Restaurants", "snippets": ["There’s been a giant community call-out for ways to support places owned by people of color or women, and we communicate a lot with our restaurant friends, like chef Yia Vang, whose restaurant Vinai is right around the corner. What’s helping is people wanting to go out and support these local businesses."], "title": "Amid ICE Raids, Running a Minneapolis Restaurant Is an Act of Resistance | Bon Appétit", "meta": {"query": "ICE raids impact on local businesses in Minneapolis"}, "citation_uuid": -1}, "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-wednesday-feb-18": {"url": "https://bringmethenews.com/minnesota-news/list-of-ice-raids-major-updates-in-minnesota-on-wednesday-feb-18", "description": "The groups have highlighted a recent press conference held by the House GOP in which they showed little inclination to confront the at-times brutal actions of federal immigration agents deployed by the Trump administration during Operation Metro Surge, which resulted in the killings of Renee Good and Alex Pretti. &quot;Parents, renters, small business owners, and clergy will call on Minnesota elected officials to show the same level of moral courage and decisive action that people from across the world have witnessed from everyday Minnesotans who have worked to protect their communities and neighbors these past months,&quot; the groups say.", "snippets": ["A rally and march is planned on Wednesday at the Minnesota Capitol by a number of activist group calling on \"state leadership to account for their inaction during Trump’s Operation Metro Surge in Minnesota and to issue demands to help our state, communities, and businesses recover.\" The protest notice was sent on behalf of Faith in Minnesota, Indivisible Twin Cities, Inquilinxs Unidxs por Justicia (IX), TakeAction Minnesota, Unidos MN, who plan to \"pack the Minnesota Capitol to hold a rally, march, and make legislative visits on Wednesday,\" the second day of the 2026 legislative session."], "title": "List of ICE raids, major updates in Minnesota on Wednesday, Feb. 18 - Bring Me The News", "meta": {"query": "Specific incidents of ICE actions affecting businesses in Minneapolis, MN"}, "citation_uuid": -1}, "https://www.mprnews.org/live-updates": {"url": "https://www.mprnews.org/live-updates", "description": "Live updates on ICE enforcement in Minnesota, with the latest developments and links to deeper reporting as events unfold.", "snippets": ["Members from the community march north on Central Avenue Northeast in Minneapolis on Sunday. The march was organized by the Minnesota Immigrant Rights Action Committee (MIRAC) to protest ICE enforcement."], "title": "The latest on ICE in Minnesota | MPR News", "meta": {"query": "ICE presence in Minneapolis MN incidents"}, "citation_uuid": -1}, "https://www.twincities.com/2026/02/04/heres-how-to-support-small-businesses-in-twin-cities-impacted-by-ice-surge/": {"url": "https://www.twincities.com/2026/02/04/heres-how-to-support-small-businesses-in-twin-cities-impacted-by-ice-surge/", "description": "Paul Area Chamber of Commerce, Minneapolis Regional Chamber and a dozen additional Twin Cities-area economic development organizations have assembled an online listing of initiatives collecting donations to support small businesses during Operation Metro Surge. The listing is online at WeLoveTC.com. Among other resources, the website includes links to legal guidance for employers, curated by Hospitality Minnesota and other business coalitions.", "snippets": ["Some 40% of business owners said they would still be viable if they could count on outside support such as grants and donations. About a fourth said they were only viable after downsizing their staff, and 9% were considering “exit strategies,” or closing for good. Alarmed by those and similar findings, the St. Paul Area Chamber of Commerce, Minneapolis Regional Chamber and a dozen additional Twin Cities-area economic development organizations have assembled an online listing of initiatives collecting donations to support small businesses during Operation Metro Surge."], "title": "Here’s how to support small businesses in Twin Cities impacted by ICE surge", "meta": {"query": "Resources for businesses impacted by ICE in Minneapolis"}, "citation_uuid": -1}, "https://minnesotanonprofits.org/ice-resources": {"url": "https://minnesotanonprofits.org/ice-resources", "description": "Money is most needed in this moment. <strong>Direct your generosity to local nonprofits, mutual aid groups, and immigrant owned restaurants and businesses</strong>. Visit immigrant-owned restaurants and businesses, which need our support as many have had to limit hours and access due to ICE activity.", "snippets": ["Report incidents involving federal agents to the Attorney General, including violations of constitutional rights, business closures, reduced access to healthcare, school, or child care, etc."], "title": "Resources: supporting community during ICE operations - Minnesota Council of Nonprofits", "meta": {"query": "ICE interactions with local businesses in Minneapolis"}, "citation_uuid": -1}, "https://www.aclu.org/press-releases/new-filings-detail-harrowing-accounts-of-ice-and-border-patrol-violence-and-intimidation-against-minnesotans": {"url": "https://www.aclu.org/press-releases/new-filings-detail-harrowing-accounts-of-ice-and-border-patrol-violence-and-intimidation-against-minnesotans", "description": "“The dozens of stories we shared with the court today only represent a small percentage of the Minnesotans whose constitutional rights were violated by federal agents since December,” said Alicia Granse, staff attorney with ACLU of Minnesota. “Many of our plaintiffs and declarants said they were afraid for their safety after their encounters with federal agents. Despite that understandable fear, they are boldly sharing their stories to demand accountability from the federal government.”", "snippets": ["MINNEAPOLIS – Today, the American Civil Liberties Union, the ACLU of Minnesota, and pro bono partners filed an amended complaint and over 80 declarations with the U.S. District Court for the District of Minnesota further exposing the harm Minnesotans are experiencing daily at the hands of federal agents. These filings show that federal agents, including Immigration and Customs Enforcement (ICE) and Border Patrol, are continuing to violate the rights of people observing, documenting, and protesting ICE activity in their neighborhoods."], "title": "New Filings Detail Harrowing Accounts of ICE and Border Patrol Violence and Intimidation Against Minnesotans | American Civil Liberties Union", "meta": {"query": "Stories of employees affected by ICE raids in Minneapolis"}, "citation_uuid": -1}}}